package com.mvc.views.mediator.fighting
{
   public class SkillMcSort
   {
      
      public static var needScaleSkillArr:Array = ["飞踢","寄生种子","臭泥爆弹","飞沙脚","模仿","泡泡","原始之力","泡沫光线","满地星","骨击一气","影子球","烟幕","骨棒","食梦","破坏死光","泥浆攻击","泡泡","催眠术","唱歌","滚动","百万吨角击","超音波","吐丝","地裂","超级吸收","钢翼","高速星星","奇异光线","水炮","旋风刀","三角攻击","水枪","溶解液","旋风","吸收","吸血","毒针","嚎叫","骨头回力镖","喷射火焰","双针","急冻光线","一字斩","剪刀断头台","极光束","角撞","飞弹针","飞叶快刀","百万吨吸收","聚宝功","泥巴射击","吵闹","草笛魔音","哈欠","薄雾球","冰球","针叶暗器","种子机关枪","回转攻","冰针","魔法叶","水电炮"];
      
      public static var both:Array = ["白雾","瑜伽姿势","自爆","大爆炸","高速移动","噪音","影子分身","折弯汤匙","自我复原","硬梆梆","缩壳","集气","忍忍","瞬间失忆","水溅跃","溶化","空气爆炸","睡觉","棱角","变性","铁尾","起死回生","吼叫","手足慌乱","神速","鬼脸","打鼾","龙爪","喷出","假指控","过热","临别礼物","假勇敢","集中猛击","挑拨","报仇","喷火","洁净光泽","喷水","搔痒"];
      
      public static var continueAttackSkill:Array = ["skill80","skill37","skill200","skill205"];
      
      public static var shareScreen1:Array = [["水炮",8],["冲浪",15],["打雷",10],["地裂",6],["大爆炸",12],["地震",8],["龙鳞之怒",6],["热风",12],["喷火",12],["喷水",12],["水电炮",8]];
      
      public static var shareScreen2:Array = [["百万吨飞腿",5],["自爆",5],["百万吨角击",5],["蛮力",5]];
      
      public static var beAttacking1:Array = [["破坏死光",5,0.05],["地球上投",5,0.05],["舍身攻击",5,0.05],["十万伏特",5,0.05],["三角攻击",10,1.2],["烈暴风",5,0.05],["独角钻",5,0.05],["毒针",2,0.3],["双针",4,0.15],["飞弹针",4,0.1],["嚎叫",1,0.3],["溶解液",1,0.25],["急冻光线",5,0.15],["喷射火焰",5,0.15],["幻象光",3,0.15],["泡沫光线",3,0.15],["极光束",7,0.15],["返拳",2,0.15],["地球上投",3,0.15],["劲力",5,0.15],["花之舞",6,0.05],["黑夜诅咒",5,0.25],["烟幕",1,0.2],["尖刺加农炮",5,0.15],["骨棒",1,0.3],["泥浆攻击",1,0.25],["吸血",1,0.25],["骨头回力镖",2,0.3],["必杀门牙",2,0.1],["超音波",3,0.3],["火焰轮",3,0.2],["电磁炮",5,0.05],["冻风",7,0.1],["岩石封闭",2,1.1,0.2],["信号光束",2,1.1,0.2],["高音",7,0.1],["毒液牙",7,0.1],["假动作",7,0.1]];
      
      public static var beAttacking2:Array = [["连续拳",2,0.9,0.2],["百万吨拳击",2,0.9,0.2],["山崩地裂",2,0.9,0.3],["打雷",2,0.9,0.2],["挖地洞",2,0.9,0.2],["高速星星",4,0.9,0.5],["利爪",1,0.9,0.1],["一字斩",1,0.9,0.15],["翅膀攻击",1,0.9,0.1],["叩打",1,0.9,0.1],["藤鞭",1,0.9,0.1],["践踏",1,0.8,0.1],["绑紧",2,1.1,0.2],["连环腿",2,1.1,0.2],["飞踢",2,1.1,0.2],["旋风腿",2,0.9,0.1],["铁头功",1,0.9,0.1],["疯狂攻击",1,0.7,0.1],["冲击",1,0.9,0.1],["泰山压顶",1,0.7,0.1],["捆绑",2,1.1,0.2],["猛撞",1,0.9,0.2],["横冲直撞",2,0.7,0.2],["瞪眼",1,1.1,0.1],["音爆",2,0.9,0.05],["石化功",1,1.1,0.2],["火花",1,0.9,0.1],["水枪",2,0.9,0.25],["啄",1,0.9,0.1],["冲钻",3,0.9,0.2],["下踢",1,0.9,0.1],["飞叶快刀",5,0.9,0.1],["毒粉末",3,0.95,0.2],["麻痹粉",3,0.95,0.2],["睡眠粉",1,0.95,0.1],["龙之怒",4,0.85,0.2],["火焰漩涡",1,0.95,0.1],["电光一闪",1,0.95,0.1],["愤怒",1,0.9,0.1],["迷雾",1,0.9,0.1],["舔舌头",1,1.15,0.35],["炸蛋",1,0.9,0.15],["飞膝撞",1,0.9,0.05],["丢球",1,0.9,0.15],["蘑菇孢子",3,0.9,0.2],["疯狂乱抓",2,0.9,0.15],["愤怒之牙",1,0.9,0.1],["劈开",1,0.9,0.1],["挣扎",2,0.9,0.2],["飞沙脚",2,0.9,0.2],["大字爆",2,1.1,0.2],["迷昏拳",3,0.9,0.2],["心眼",1,0.85,0.7],["超级吸收",2,0.85,0.2],["咒语",2,0.9,0.1],["细雪",2,0.95,0.1],["虚晃一招",2,0.9,0.2],["泥汤",1,0.95,0.1],["骨击一气",1,0.7,0.4],["龙鳞之怒",2,1.1,0.2],["猛推",1,0.7,0.1],["种子机关枪",1,0.7,0.1],["冰针",1,0.7,0.1],["毒尾",2,0.85,0.2],["泥巴射击",2,0.85,0.2],["魔法叶",2,1.1,0.2],["影子拳",1,0.95,0.1],["突击爪",1,0.9,0.1],["劈瓦",1,0.9,0.1],["强攻",1,0.9,0.1],["火焰踢",1,0.9,0.1],["流星拳",1,0.9,0.1],["喷出",1,0.95,0.1],["集中猛击",1,0.95,0.1],["报仇",1,0.95,0.1],["落拳",2,0.9,0.2]];
      
      public static var beAttacking3:Array = ["电磁波","念力","幻象术","连切","浊流","流沙地狱","惊吓","鬼火"];
      
      public static var beAttacking4:Array = ["地狱滚动","高速移动","银色旋风"];
      
      public static var colorChange:Array = [["唱歌",16777215,0.5,0.7],["白雾",16777215,0.7,0.7],["大蛇瞪眼",0,0.8,0.7],["雷光掌",0,0.8,0.7],["瞪眼",0,0.8,0.7],["极光束",0,0.8,1.3],["吸收",0,0.8,0.7],["百万吨吸收",0,0.8,0.7],["电击",0,0.8,0.7],["念力",0,0.8,0.7],["黑雾",0,0.8,0.7],["幻象术",0,0.8,0.3],["瑜伽姿势",0,0.8,0.7],["瞬间移动",0,0.8,0.7],["黑夜诅咒",0,0.8,0.7],["瞬间失忆",0,0.8,0.7],["食梦",0,0.8,0.7],["唱歌",0,0.8,0.7],["超音波",0,0.8,0.7],["吐丝",0,0.8,0.7],["螃蟹拳",3767180,0.8,0.7],["闪光",14595468,0.8,0.7],["火焰拳",15149336,0.8,0.7],["喷射火焰",15149336,0.8,0.7],["急冻光线",8705758,0.8,0.8],["阳光烈焰",0,0.9,0.7],["十万伏特",0,0.9,0.7],["奇异光线",0,0.9,1],["高空攻击",0,0.9,0.7],["三角攻击",0,0.9,2],["打雷",0,0.95,0.7],["破坏死光",0,1,0.8],["地球上投",0,1,0.7],["百万吨飞腿",8388608,1,0.7],["自爆",8388608,1,0.5],["大字爆",8388608,1,0.7],["地裂",10836537,1,0.5],["电磁波",0,1,0.7],["水炮",0,1,0.7],["舍身攻击",0,1,0.7],["暴风雪",0,1,0.7],["大爆炸",16777215,1,0.7],["高速移动",16777215,1,0.7],["冲浪",0,1,0.7],["地震",0,1,0.7],["神通力",0,1,0.7],["伏特攻击",0,1,0.7],["破灭愿望",0,1,0.7],["精神提升",0,1,0.7],["电击波",0,1,0.7],["水波动",0,1,0.7],["过热",0,1,0.7],["破空斩",0,1,0.7],["爆炸燃烧",0,1,0.7]];
       
      public function SkillMcSort()
      {
         super();
      }
   }
}
