ExcelLua.Jiazu_Lingdizhanbaoming={{"id","name","artid","lv","cost","cityid","practice","exp","silver","mall","describe"},
key1={1,"凌云台",2661,2,100,11,10000,5000,8000,"1002084","凌云台挂机修炼加成10%,普通关卡经验加成5%,银两加成8%,家族宝商处可购买特殊物品。"},
key2={2,"乌衣巷",2662,3,100,12,15000,7500,12000,"1002085","乌衣巷挂机修炼加成15%,普通关卡经验加成7.5%,银两加成12%,家族宝商处可购买特殊物品。"},
key3={3,"婕妤坊",2659,3,100,13,20000,10000,16000,"1002086","婕妤坊挂机修炼加成20%,普通关卡经验加成10%,银两加成16%,家族宝商处可购买特殊物品。"},
key4={4,"牯岭街",2660,4,100,14,25000,12500,20000,"1002087","牯岭街挂机修炼加成25%,普通关卡经验加成12.5%,银两加成20%,家族宝商处可购买特殊物品。"},
key5={5,"待定",2658,4,100,0,30000,15000,24000,"1002088,1203014,1500107,1500108,1002087","待定挂机修炼加成30%,普通关卡经验加成15%,银两加成24%,家族宝商处可购买特殊物品。"}}