ExcelLua.Zhuangyuan_Chushinvpu={{"id","age","condition","imageId","imageId1","firstTalk1","firstTalk2","perfect","normal","bed","cost"},
key1={1,1,"0,0",308,309,"既、既然都这么求我了，就勉强做你的","女人…错了！是女仆！（脸红）","人家、人家一点也不高兴啦（脸红）~~","哦、啊……也许是呢~","哇呜呜呜呜呜呜呜呜……(大哭）",1},
key2={2,31,"1,4",104,83,"主人大人，今后就由我来照顾您吧~","","啊……（温柔的抱住）","嗯嗯~是这样啊~","唔……（难过）",100000},
key3={3,47,"2,5",1911,1912,"吾问汝，汝就是我的主人吗？","","不愧是吾之主，深知吾心呐。","唔，原来会有那样的想法啊。","……（怒）",1000000},
key4={4,61,"3,6",1908,1909,"唔呀唔呀~汝看起来很好吃呢~今后会","有很多让人脸红的事情额~呼呼呼~","汝！果然好可爱！！","嗯？好像很无趣啊。","呵呵呵呵（阴笑）……",10000000}}