ExcelLua.Tiaozhan_Tiaozhanmiaoshu={{"id","type","ui","what","sort","artid","time","discribe","description","id1"},
key1={1,1,"4_1_1","世界boss",1,2775,"每日19:30~20:00开放","每天可以和大家一起挑战世界BOSS呢！相约小伙伴们崛起吧！","很多银两和经验哟（中途退出的话，活动结束后去领奖面板领取哦）",85},
key5={5,2,"4_2_1","精英副本",1,594,"全天开放","可以和小伙伴一起去打额~带有特殊的英魂还能获得属性加成！拿起武器战斗吧！小伙伴们！","装备打造卷轴和材料，还有珍贵的资质点礼包，女仆道具什么的",74},
key6={6,2,"4_2_2","勇闯天关",2,1178,"全天开放","勇士才来闯一闯什么的，天关就在那里，征服它吧！一层一层一层又一层不在话下的！","宝石啦、银两啦、升星材料啦~",65},
key8={8,1,"4_1_2","十八铜人",2,598,"全天开放","世人皆传，十八铜人阵暗含绝世神功，得此神功，即可号令天下，闯得阵愈多者，自是豪杰！憋满一口血出发吧！骚年！","很多很多经验哟",71},
key9={9,3,"4_3_1","决战巅峰",1,595,"全天开放","还在等什么？小伙伴们都踩在你头顶上了好不好！速速战胜他们啊！巅峰之顶只能是我好不好！哇哈哈哈哈哈！","排名奖励很多银两哦，参与会有声望哟",66},
key10={10,1,"4_1_4","阵营战",4,1478,"每日20:10~20:30开放","为了自己的阵营而战吧！！！","重在参与，大量经验和声望等着大家拿额~~~",84},
key13={13,2,"4_2_3","寻宝",3,955,"全天开放","扔扔骰子赌赌运气啦！","经验银两元宝啊，还有宠物道具和英魂卡呢~高级宝石和藏宝图也有好吗",17}}