ExcelLua.Jiaobenduihua_Xinshoudonghua={{"id","dialog"},
key101={101,"1#天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗……"},
key102={102,"1000999#为什么……你不是创世神吗？为什么你要毁掉我的家，为什么还要杀害我的妈妈……这都是为什么……@1000080#呸！杂碎，老子灭了你还需要理由？给我滚！！@1000999#啊！！！"},
key103={103,"1#呔！住手！"},
key104={104,"1000080#你！你竟敢挡在我八荒炼骨龙盘古的面前！你！你这杂碎！你这蛆虫！老子要砍了你！！！"},
key105={105,"1#不好！危险！小蝴蝶，你快躲起来！@1000999#咳咳，你……不要管我了……我很感激你救了我，不过……你还是先跑吧……@1#跑？为什么？就因为他是盘古？怎么可能！！老子背负着的可是全世界啊！@1000080#愚蠢，你们这群蝼蚁总是嚷嚷着什么希望什么责任，根本就不懂什么叫现实，老子就让你明白，什么叫差距！@1000999#……啊，人类……你要加油啊……绝对，绝对不能输啊！"},
key106={106,"1#拿梦想做赌注，我！怎么！舍得！输！"},
key107={107,"1#哼！开天盘古，不过是撑起了洪川天地，就以为能随意的蹂躏大地了吗！（哇哈哈~老子是英雄！这拉轰的感觉，哇哈哈~掌声在哪里~~）"}}