-- Filename: DB_Daytask.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Daytask", package.seeall)

keys = {
	"id", "name", "taskDes", "needNum", "score", "type", "sortId", "quality", "reward", "taskDes2", "switch", "icon", "needLv", 
}

Daytask = {
	id_1 = {1, "副本", "成功挑战据点10次", 10, 15, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 1, },
	id_2 = {2, "竞技场", "竞技场挑战3次", 3, 15, 5, 6, 5, "7|60002|10", nil, 8, "day_task_9.png", 1, },
	id_3 = {3, "送耐力", "给5个好友赠送耐力", 5, 10, 6, 11, 4, "7|60019|2", nil, nil, "day_task_10.png", 1, },
	id_4 = {4, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 10, 7, 14, 4, "1|0|10000", nil, 23, "day_task_11.png", 1, },
	id_5 = {5, "探索", "进行10次探索", 10, 10, 8, 2, 4, "7|60019|2", nil, 30, "day_task_5.png", 1, },
	id_6 = {6, "喝可乐", "喝可乐1次", 1, 15, 9, 13, 5, "1|0|10000", nil, nil, "day_task_12.png", 1, },
	id_7 = {7, "公会建设", "进行公会建设1次", 1, 15, 14, 12, 5, "1|0|10000", nil, 23, "day_task_16.png", 1, },
	id_8 = {8, "酒馆招募", "在酒馆招募3次", 3, 10, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 1, },
	id_9 = {9, "饰品强化", "饰品强化3次", 3, 5, 18, 8, 3, "7|60006|1", nil, 19, "day_task_3.png", 1, },
	id_10 = {10, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 3, "3|0|30", nil, 36, "day_task_20.png", 1, },
	id_11 = {11, "副本", "成功挑战据点10次", 10, 15, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 20, },
	id_12 = {12, "竞技场", "竞技场挑战3次", 3, 10, 5, 7, 4, "7|60002|10", nil, 8, "day_task_9.png", 20, },
	id_13 = {13, "送耐力", "给5个好友赠送耐力", 5, 5, 6, 12, 3, "7|60019|2", nil, nil, "day_task_10.png", 20, },
	id_14 = {14, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 10, 7, 15, 4, "1|0|10000", nil, 23, "day_task_11.png", 20, },
	id_15 = {15, "探索", "进行10次探索", 10, 10, 8, 2, 4, "7|60019|2", nil, 30, "day_task_5.png", 20, },
	id_16 = {16, "喝可乐", "喝可乐1次", 1, 10, 9, 14, 5, "1|0|10000", nil, nil, "day_task_12.png", 20, },
	id_17 = {17, "日常副本", "成功挑战日常副本1次", 1, 10, 11, 5, 4, "7|440023|3", nil, 9, "day_task_14.png", 20, },
	id_18 = {18, "公会建设", "进行公会建设1次", 1, 5, 14, 13, 3, "1|0|10000", nil, 23, "day_task_16.png", 20, },
	id_19 = {19, "酒馆招募", "在酒馆招募3次", 3, 10, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 20, },
	id_20 = {20, "刷新伙伴商店", "刷新伙伴商店1次", 1, 10, 16, 16, 5, "11|0|30", nil, 21, "day_task_17.png", 20, },
	id_21 = {21, "饰品强化", "饰品强化3次", 3, 10, 18, 9, 3, "7|60006|1", nil, 19, "day_task_3.png", 20, },
	id_22 = {22, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 3, "3|0|30", nil, 36, "day_task_20.png", 20, },
	id_23 = {23, "副本", "成功挑战据点10次", 10, 5, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 30, },
	id_24 = {24, "竞技场", "竞技场挑战3次", 3, 10, 5, 8, 5, "7|60002|10", nil, 8, "day_task_9.png", 30, },
	id_25 = {25, "送耐力", "给5个好友赠送耐力", 5, 5, 6, 14, 4, "7|60019|2", nil, nil, "day_task_10.png", 30, },
	id_26 = {26, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 5, 7, 17, 4, "1|0|10000", nil, 23, "day_task_11.png", 30, },
	id_27 = {27, "探索", "进行10次探索", 10, 10, 8, 2, 5, "7|60019|2", nil, 30, "day_task_5.png", 30, },
	id_28 = {28, "喝可乐", "喝可乐1次", 1, 10, 9, 16, 5, "1|0|10000", nil, nil, "day_task_12.png", 30, },
	id_29 = {29, "日常副本", "成功挑战日常副本1次", 1, 10, 11, 5, 5, "7|440023|3", nil, 9, "day_task_14.png", 30, },
	id_30 = {30, "公会建设", "进行公会建设1次", 1, 5, 14, 15, 4, "1|0|10000", nil, 23, "day_task_16.png", 30, },
	id_31 = {31, "酒馆招募", "在酒馆招募3次", 3, 10, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 30, },
	id_32 = {32, "刷新伙伴商店", "刷新伙伴商店1次", 1, 10, 16, 18, 5, "11|0|30", nil, 21, "day_task_17.png", 30, },
	id_33 = {33, "饰品强化", "饰品强化3次", 3, 5, 18, 10, 5, "7|60006|1", nil, 19, "day_task_3.png", 30, },
	id_34 = {34, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 4, "3|0|30", nil, 36, "day_task_20.png", 30, },
	id_35 = {35, "重置深海监狱", "成功重置深海监狱1次", 1, 10, 20, 20, 5, "7|60503|2", nil, 38, "day_task_21.png", 30, },
	id_36 = {36, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 4, "3|0|30", nil, 36, "day_task_23.png", 1, },
	id_37 = {37, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 5, "3|0|30", nil, 36, "day_task_23.png", 20, },
	id_38 = {38, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 5, "3|0|30", nil, 36, "day_task_23.png", 30, },
	id_39 = {39, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 5, "3|0|30", nil, 36, "day_task_23.png", 35, },
	id_40 = {40, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 5, "3|0|30", nil, 36, "day_task_23.png", 42, },
	id_41 = {41, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 4, "3|0|30", nil, 36, "day_task_24.png", 1, },
	id_42 = {42, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 5, "3|0|30", nil, 36, "day_task_24.png", 20, },
	id_43 = {43, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 5, "3|0|30", nil, 36, "day_task_24.png", 30, },
	id_44 = {44, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 5, "3|0|30", nil, 36, "day_task_24.png", 35, },
	id_45 = {45, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 5, "3|0|30", nil, 36, "day_task_24.png", 42, },
	id_46 = {46, "装备附魔", "装备附魔3次", 3, 10, 17, 11, 5, "7|60502|3", nil, 24, "day_task_18.png", 35, },
	id_47 = {47, "副本", "成功挑战据点10次", 10, 5, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 35, },
	id_48 = {48, "竞技场", "竞技场挑战3次", 3, 10, 5, 8, 5, "7|60002|10", nil, 8, "day_task_9.png", 35, },
	id_49 = {49, "送耐力", "给5个好友赠送耐力", 5, 5, 6, 14, 4, "7|60019|2", nil, nil, "day_task_10.png", 35, },
	id_50 = {50, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 5, 7, 17, 4, "1|0|10000", nil, 23, "day_task_11.png", 35, },
	id_51 = {51, "探索", "进行10次探索", 10, 10, 8, 2, 5, "7|60019|2", nil, 30, "day_task_5.png", 35, },
	id_52 = {52, "喝可乐", "喝可乐1次", 1, 10, 9, 16, 5, "1|0|10000", nil, nil, "day_task_12.png", 35, },
	id_53 = {53, "日常副本", "成功挑战日常副本1次", 1, 10, 11, 5, 5, "7|440023|3", nil, 9, "day_task_14.png", 35, },
	id_54 = {54, "公会建设", "进行公会建设1次", 1, 5, 14, 15, 4, "1|0|10000", nil, 23, "day_task_16.png", 35, },
	id_55 = {55, "酒馆招募", "在酒馆招募3次", 3, 5, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 35, },
	id_56 = {56, "刷新伙伴商店", "刷新伙伴商店1次", 1, 10, 16, 18, 5, "11|0|30", nil, 21, "day_task_17.png", 35, },
	id_57 = {57, "饰品强化", "饰品强化3次", 3, 5, 18, 10, 5, "7|60006|1", nil, 19, "day_task_3.png", 35, },
	id_58 = {58, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 4, "3|0|30", nil, 36, "day_task_20.png", 35, },
	id_59 = {59, "重置深海监狱", "成功重置深海监狱1次", 1, 5, 20, 20, 5, "7|60503|2", nil, 38, "day_task_21.png", 35, },
	id_60 = {60, "装备附魔", "装备附魔3次", 3, 10, 17, 11, 5, "7|60502|3", nil, 24, "day_task_18.png", 42, },
	id_61 = {61, "副本", "成功挑战据点10次", 10, 5, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 42, },
	id_62 = {62, "竞技场", "竞技场挑战3次", 3, 10, 5, 8, 5, "7|60002|10", nil, 8, "day_task_9.png", 42, },
	id_63 = {63, "送耐力", "给5个好友赠送耐力", 5, 5, 6, 14, 4, "7|60019|2", nil, nil, "day_task_10.png", 42, },
	id_64 = {64, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 5, 7, 17, 4, "1|0|10000", nil, 23, "day_task_11.png", 42, },
	id_65 = {65, "探索", "进行10次探索", 10, 5, 8, 2, 5, "7|60019|2", nil, 30, "day_task_5.png", 42, },
	id_66 = {66, "喝可乐", "喝可乐1次", 1, 10, 9, 16, 5, "1|0|10000", nil, nil, "day_task_12.png", 42, },
	id_67 = {67, "日常副本", "成功挑战日常副本1次", 1, 10, 11, 5, 5, "7|440023|3", nil, 9, "day_task_14.png", 42, },
	id_68 = {68, "公会建设", "进行公会建设1次", 1, 5, 14, 15, 4, "1|0|10000", nil, 23, "day_task_16.png", 42, },
	id_69 = {69, "酒馆招募", "在酒馆招募3次", 3, 5, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 42, },
	id_70 = {70, "刷新伙伴商店", "刷新伙伴商店1次", 1, 5, 16, 18, 5, "11|0|30", nil, 21, "day_task_17.png", 42, },
	id_71 = {71, "饰品强化", "饰品强化3次", 3, 5, 18, 10, 5, "7|60006|1", nil, 19, "day_task_3.png", 42, },
	id_72 = {72, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 4, "3|0|30", nil, 36, "day_task_20.png", 42, },
	id_73 = {73, "重置深海监狱", "成功重置深海监狱1次", 1, 5, 20, 20, 5, "7|60503|2", nil, 38, "day_task_21.png", 42, },
	id_74 = {74, "资源矿", "成功占领资源矿1次", 1, 5, 21, 21, 4, "1|0|20000", nil, 11, "day_task_22.png", 42, },
	id_75 = {75, "购买宝物礼盒", "在酒馆中购买1次宝物礼盒", 1, 5, 24, 24, 4, "3|0|50", nil, 36, "shipinlihe.png", 30, },
	id_76 = {76, "世界boss", "攻击1次世界boss", 1, 5, 12, 25, 5, "1|0|20000", nil, 27, "day_task_7.png", 30, },
	id_77 = {77, "购买宝物礼盒", "在酒馆中购买1次宝物礼盒", 1, 5, 24, 24, 4, "3|0|50", nil, 36, "shipinlihe.png", 35, },
	id_78 = {78, "世界boss", "攻击1次世界boss", 1, 5, 12, 25, 5, "1|0|20000", nil, 27, "day_task_7.png", 35, },
	id_79 = {79, "购买宝物礼盒", "在酒馆中购买1次宝物礼盒", 1, 5, 24, 24, 4, "3|0|50", nil, 36, "shipinlihe.png", 42, },
	id_80 = {80, "世界boss", "攻击1次世界boss", 1, 5, 12, 25, 5, "1|0|20000", nil, 27, "day_task_7.png", 42, },
	id_81 = {81, "精英副本", "成功挑战精英副本1次", 1, 5, 2, 26, 5, "7|60008|20", nil, 4, "day_task_7.png", 42, },
	id_82 = {82, "装备附魔", "装备附魔3次", 3, 10, 17, 11, 5, "7|60502|3", nil, 24, "day_task_18.png", 38, },
	id_83 = {83, "副本", "成功挑战据点10次", 10, 5, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 38, },
	id_84 = {84, "竞技场", "竞技场挑战3次", 3, 10, 5, 8, 5, "7|60002|10", nil, 8, "day_task_9.png", 38, },
	id_85 = {85, "送耐力", "给5个好友赠送耐力", 5, 5, 6, 14, 4, "7|60019|2", nil, nil, "day_task_10.png", 38, },
	id_86 = {86, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 5, 7, 17, 4, "1|0|10000", nil, 23, "day_task_11.png", 38, },
	id_87 = {87, "探索", "进行10次探索", 10, 10, 8, 2, 5, "7|60019|2", nil, 30, "day_task_5.png", 38, },
	id_88 = {88, "喝可乐", "喝可乐1次", 1, 10, 9, 16, 5, "1|0|10000", nil, nil, "day_task_12.png", 38, },
	id_89 = {89, "日常副本", "成功挑战日常副本1次", 1, 10, 11, 5, 5, "7|440023|3", nil, 9, "day_task_14.png", 38, },
	id_90 = {90, "公会建设", "进行公会建设1次", 1, 5, 14, 15, 4, "1|0|10000", nil, 23, "day_task_16.png", 38, },
	id_91 = {91, "酒馆招募", "在酒馆招募3次", 3, 5, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 38, },
	id_92 = {92, "刷新伙伴商店", "刷新伙伴商店1次", 1, 5, 16, 18, 5, "11|0|30", nil, 21, "day_task_17.png", 38, },
	id_93 = {93, "饰品强化", "饰品强化3次", 3, 5, 18, 10, 5, "7|60006|1", nil, 19, "day_task_3.png", 38, },
	id_94 = {94, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 4, "3|0|30", nil, 36, "day_task_20.png", 38, },
	id_95 = {95, "重置深海监狱", "成功重置深海监狱1次", 1, 5, 20, 20, 5, "7|60503|2", nil, 38, "day_task_21.png", 38, },
	id_96 = {96, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 5, "3|0|30", nil, 36, "day_task_23.png", 38, },
	id_97 = {97, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 5, "3|0|30", nil, 36, "day_task_24.png", 38, },
	id_98 = {98, "购买宝物礼盒", "在酒馆中购买1次宝物礼盒", 1, 5, 24, 24, 4, "3|0|50", nil, 36, "shipinlihe.png", 38, },
	id_99 = {99, "世界boss", "攻击1次世界boss", 1, 5, 12, 25, 5, "1|0|20000", nil, 27, "day_task_7.png", 38, },
	id_100 = {100, "精英副本", "成功挑战精英副本1次", 1, 5, 2, 26, 5, "7|60008|20", nil, 4, "day_task_7.png", 38, },
	id_101 = {101, "装备附魔", "装备附魔3次", 3, 5, 17, 11, 5, "7|60502|3", nil, 24, "day_task_18.png", 52, },
	id_102 = {102, "副本", "成功挑战据点10次", 10, 5, 1, 1, 5, "7|440023|3", nil, nil, "day_task_6.png", 52, },
	id_103 = {103, "竞技场", "竞技场挑战3次", 3, 10, 5, 8, 5, "7|60002|10", nil, 8, "day_task_9.png", 52, },
	id_104 = {104, "送耐力", "给5个好友赠送耐力", 5, 5, 6, 14, 4, "7|60019|2", nil, nil, "day_task_10.png", 52, },
	id_105 = {105, "喝咖啡", "在人鱼咖啡厅喝1次咖啡", 1, 5, 7, 17, 4, "1|0|10000", nil, 23, "day_task_11.png", 52, },
	id_106 = {106, "探索", "进行10次探索", 10, 10, 8, 2, 5, "7|60019|2", nil, 30, "day_task_5.png", 52, },
	id_107 = {107, "喝可乐", "喝可乐1次", 1, 5, 9, 16, 5, "1|0|10000", nil, nil, "day_task_12.png", 52, },
	id_108 = {108, "日常副本", "成功挑战日常副本1次", 1, 10, 11, 5, 5, "7|440023|3", nil, 9, "day_task_14.png", 52, },
	id_109 = {109, "公会建设", "进行公会建设1次", 1, 5, 14, 15, 4, "1|0|10000", nil, 23, "day_task_16.png", 52, },
	id_110 = {110, "酒馆招募", "在酒馆招募3次", 3, 5, 15, 3, 4, "11|0|50", nil, 3, "day_task_4.png", 52, },
	id_111 = {111, "刷新伙伴商店", "刷新伙伴商店1次", 1, 5, 16, 18, 5, "11|0|30", nil, 21, "day_task_17.png", 52, },
	id_112 = {112, "饰品强化", "饰品强化3次", 3, 5, 18, 10, 5, "7|60006|1", nil, 19, "day_task_3.png", 52, },
	id_113 = {113, "贝里购买", "购买贝里1次", 1, 5, 19, 19, 4, "3|0|30", nil, 36, "day_task_20.png", 52, },
	id_114 = {114, "重置深海监狱", "成功重置深海监狱1次", 1, 5, 20, 20, 5, "7|60503|2", nil, 38, "day_task_21.png", 52, },
	id_115 = {115, "购买体力", "在酒馆中购买1次体力", 1, 5, 22, 22, 5, "3|0|30", nil, 36, "day_task_23.png", 52, },
	id_116 = {116, "购买耐力", "在酒馆中购买1次耐力", 1, 5, 23, 23, 5, "3|0|30", nil, 36, "day_task_24.png", 52, },
	id_117 = {117, "购买宝物礼盒", "在酒馆中购买1次宝物礼盒", 1, 5, 24, 24, 4, "3|0|50", nil, 36, "shipinlihe.png", 52, },
	id_118 = {118, "世界boss", "攻击1次世界boss", 1, 5, 12, 25, 5, "1|0|20000", nil, 27, "day_task_7.png", 52, },
	id_119 = {119, "精英副本", "成功挑战精英副本1次", 1, 5, 2, 26, 5, "7|60008|20", nil, 4, "day_task_7.png", 52, },
	id_120 = {120, "觉醒副本", "成功挑战觉醒副本5次", 5, 10, 25, 27, 5, "7|60033|25", nil, 40, "day_task_6.png", 52, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Daytask["id_" .. key_id]
	assert(id_data, "Daytask not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Daytask) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Daytask"] = nil
	package.loaded["DB_Daytask"] = nil
	package.loaded["db/DB_Daytask"] = nil
end

