-- Filename: DB_Email.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Email", package.seeall)

keys = {
	"id", "purpose", "system", "name", "content", 
}

Email = {
	id_1 = {1, "资源岛占领期完成", "资源岛", "资源岛到期", "您的资源岛占领时间已到，共占领|，总计获得|贝里，获得|木材。", },
	id_2 = {2, "被别人抢夺后（对方失败）", "资源岛", "守护资源岛成功", "试图抢夺您的资源岛，不过失败了。", },
	id_3 = {3, "被别人抢夺后（对方成功）", "资源岛", "守护资源岛失败", "夺走了您的资源岛，您共占领资源岛|，总计获得|贝里，获得|木材。", },
	id_4 = {4, "自己去占领别人的资源岛（成功）", "资源岛", "资源岛抢夺", "您刚刚成功抢夺了|的资源岛。", },
	id_5 = {5, "自己去占领别人的资源岛（失败）", "资源岛", "资源岛抢夺", "您刚刚抢夺了|的资源岛，不过失败了。", },
	id_6 = {6, "自己资源岛被强行夺走（成功）", "资源岛", "资源岛强夺", "强行夺走了您的资源岛，您共占领资源岛|,总计获得|贝里，获得|木材。", },
	id_7 = {7, "自己资源岛被强行夺走（失败）", "资源岛", "资源岛强夺", "强行抢夺了您的资源岛，不过失败了", },
	id_8 = {8, "强行夺走别人资源岛（成功）", "资源岛", "资源岛强夺", "您刚刚成功强夺了|的资源岛", },
	id_9 = {9, "强行夺走别人资源岛（失败）", "资源岛", "资源岛强夺", "您刚刚强夺了|的资源岛，不过失败了。", },
	id_10 = {10, "申请好友", "好友", "申请好友", "|想和您成为好友，一起在伟大航路上冒险！附言:", },
	id_11 = {11, "同意好友请求", "好友", "同意好友请求", "玩家|同意了你的好友申请，可以准备开始欢庆的宴会了！", },
	id_12 = {12, "拒绝好友请求", "好友", "拒绝好友请求", "玩家|拒绝了你的好友申请", },
	id_13 = {13, "断绝好友关系", "好友", "断绝好友关系", "玩家|断绝了与你的好友关系", },
	id_14 = {14, "好友留言", "好友", "好友留言", ":", },
	id_15 = {15, "竞技场被击败", "竞技场", "竞技场被击败", "玩家|在竞技场中轻松击败了你，你的竞技场排名降至", },
	id_16 = {16, "竞技场防守成功", "竞技场", "竞技场防守成功", "玩家|在竞技场中挑战你，但被你轻松击败了", },
	id_17 = {17, "竞技场幸运排名奖励", "竞技场", "竞技场幸运排名奖励", "恭喜您在竞技场中获得了幸运排名|，获得幸运奖励", },
	id_18 = {18, "竞技场排名奖励", "竞技场", "竞技场排名奖励", "恭喜您在竞技场中取得了第|名的成绩，获得奖励", },
	id_19 = {19, "申请加入公会（成功）", "公会", "申请公会成功", "恭喜！审核已通过，您已成功加入了|，快去和大家打个招呼吧~", },
	id_20 = {20, "申请加入公会（失败）", "公会", "申请公会失败", "很遗憾~|拒绝了您的加入申请！", },
	id_21 = {21, "踢出公会", "公会", "踢出公会", "您被|从|踢出！", },
	id_22 = {22, "充值了XX金币", "充值", "充值", "恭喜你成功充值了", },
	id_23 = {23, "被掠夺", "夺宝", "被抢夺碎片", "玩家|抢夺了你，你失去了|1个。", },
	id_24 = {24, "翻牌被掠夺贝里", "竞技场系统", "竞技场被掠夺贝里", "玩家|在竞技场中轻松击败了你，你被掠夺了|贝里，排名降至|。", },
	id_25 = {25, "翻牌被掠夺贝里", "夺宝系统", "夺宝被掠夺贝里", "玩家|抢夺了你，你被掠夺了|贝里，失去|1个。", },
	id_26 = {26, "翻牌被掠夺贝里", "比武系统", "比武被掠夺贝里", "玩家|在比武场中击败了你，你被掠夺了|贝里，失去|积分。", },
	id_27 = {27, "比武积分被抢夺（成功）", "比武系统", "比武积分抢夺", "玩家|在比武场中击败了你，你失去了|积分。", },
	id_28 = {28, "比武排行奖励", "比武系统", "比武排行奖励", "恭喜您在比武中取得了第|名的成绩，获得奖励|。", },
	id_29 = {29, "翻牌没抢到碎片被掠夺贝里", "夺宝系统", "夺宝被掠夺贝里", "玩家|抢夺了你，你被掠夺了|贝里。", },
	id_30 = {30, "VIP变动", "充值", "VIP", "恭喜您成为了VIP|玩家，请尽情体验您的VIP福利与特权！", },
	id_31 = {31, "竞技场被击败", "竞技场", "竞技场被击败", "玩家|在竞技场中轻松击败了你，你的竞技场排名没有改变", },
	id_32 = {32, "竞技场被击败被掠夺", "竞技场", "竞技场被击败", "玩家|在竞技场中轻松击败了你，你被掠夺了|贝里，竞技场排名没有改变", },
	id_33 = {33, "公会会长退出时成为某某公会会长", "公会", "被任命为会长", "恭喜您成为|公会会长，公会密码重置为初始密码。", },
	id_34 = {34, "资源岛放弃", "资源岛", "放弃资源岛", "您放弃了资源岛，共占领资源岛|，总计获得|贝里，获得|木材。", },
	id_35 = {35, "占领时间结束", "资源岛", "资源岛协助", "您协助的资源岛占领时间已经结束，共协助|，总计获得|贝里，获得|木材。", },
	id_36 = {36, "主动放弃协助", "资源岛", "资源岛协助", "您放弃了对资源岛的协助，共协助|，总计获得|贝里，获得|木材。", },
	id_37 = {37, "资源岛被占领", "资源岛", "资源岛协助", "您所协助的资源岛被|占领，共协助|，总计获得|贝里，获得|木材。", },
	id_38 = {38, "资源岛被放弃", "资源岛", "资源岛协助", "您协助的资源岛已被|放弃，共协助|，总计获得|贝里，获得|木材。", },
	id_39 = {39, "协助被抢夺", "资源岛", "资源岛协助", "您被|抢夺为该玩家的协助者，之前共协助|，总计获得|贝里，获得|木材。", },
	id_40 = {40, "协助时间结束", "资源岛", "资源岛协助", "您对|资源岛的协助时间已满，共协助|，总计获得|贝里，获得|木材。", },
	id_41 = {41, "协助被抢夺矿主提示", "资源岛", "资源岛协助", "很遗憾，您所占领资源岛的协助军被|抢夺，本次共协助|。", },
	id_42 = {42, "金币资源岛1小时保底贝里奖励", "资源岛", "守护资源岛失败", "夺走了您的资源岛，您共占领资源岛|，总计获得|基础贝里，获得|基础木材。", },
	id_43 = {43, "仇人被掠夺贝里", "夺宝", "被偷取贝里", "由于您抢夺了|的宝物碎片，被他视为仇人，他愤怒满满地偷取了您|贝里，一脸满足的跑了！", },
	id_44 = {44, "全服资源岛被抢夺", "资源岛", "抢矿资源信息", "|抢了|在|的|矿", },
	id_45 = {45, "切磋被击败", "好友", "切磋被击败", "玩家|在好友切磋中挑战你，你不幸被击败。", },
	id_46 = {46, "切磋胜利", "好友", "切磋胜利", "玩家|在好友切磋中挑战你，但被你轻松击败了。", },
	id_47 = {47, "申请开启公会副本", "公会", "申请开启公会副本", "您的公会成员|申请开启|公会副本。", },
	id_48 = {48, "申请重置公会副本", "公会", "申请重置公会副本", "您的公会成员|申请重置|公会副本。", },
	id_49 = {49, "别人挑战你并胜利", "海盗激斗", "海盗激斗", "|挑战你，并轻松击败了你，你的海盗激斗排名降至最后一名！", },
	id_50 = {50, "别人挑战你并失败", "海盗激斗", "海盗激斗", "|挑战你，但被你轻松击败了！", },
	id_51 = {51, "你挑战别人并胜利", "海盗激斗", "海盗激斗", "你挑战|，并轻松击败了对手，你的海盗激斗排名升至", },
	id_52 = {52, "你挑战别人并失败", "海盗激斗", "海盗激斗", "你挑战|，可惜挑战失败了，你的海盗激斗排名降至最后一名！", },
	id_53 = {53, "连杀战报", "海盗激斗", "海盗激斗", "|击败|，达成%s连杀！快来个人阻止他吧！", },
	id_54 = {54, "终结连杀战报", "海盗激斗", "海盗激斗", "|击败|，|的%s连杀被终结！听说你很强？", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Email["id_" .. key_id]
	assert(id_data, "Email not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Email) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Email"] = nil
	package.loaded["DB_Email"] = nil
	package.loaded["db/DB_Email"] = nil
end

