-- Filename: DB_Item_conch.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Item_conch", package.seeall)

keys = {
	"id", "name", "info", "icon_small", "icon_big", "item_type", "quality", "sellable", "sellType", "sellNum", "maxStacking", "canDestroy", "type", "baseExp", "upgradeID", "baseAtt", "growAtt", "maxLevel", "baseMaxLevelArg", "maxLevelArg", "scorce", "sort", 
}

Item_conch = {
	id_70001 = {70001, "斩击贝", "物攻型", "conch_wugong.png", nil, 13, 2, 1, 1, 1000, 1, 1, 1, 50, 111, "2|6", "2|6", 30, 5, 50, 4, 1, },
	id_70002 = {70002, "激光贝", "魔攻型", "conch_mogong.png", nil, 13, 2, 1, 1, 1000, 1, 1, 2, 50, 111, "3|6", "3|6", 30, 5, 50, 4, 2, },
	id_70003 = {70003, "治疗贝", "治疗型", "conch_zhiliao.png", nil, 13, 2, 1, 1, 1000, 1, 1, 3, 50, 101, "84|6", "84|6", 30, 5, 50, 4, 12, },
	id_70004 = {70004, "营养贝", "被治疗型", "conch_beizhiliao.png", nil, 13, 2, 1, 1, 1000, 1, 1, 4, 50, 101, "85|9", "85|9", 30, 5, 50, 4, 13, },
	id_70005 = {70005, "铁甲贝", "物防型", "conch_wufang.png", nil, 13, 2, 1, 1, 1000, 1, 1, 5, 50, 111, "4|3", "4|3", 30, 5, 50, 4, 3, },
	id_70006 = {70006, "光墙贝", "魔防型", "conch_mofang.png", nil, 13, 2, 1, 1, 1000, 1, 1, 6, 50, 111, "5|3", "5|3", 30, 5, 50, 4, 4, },
	id_70007 = {70007, "生命贝", "生命型", "conch_shengming.png", nil, 13, 2, 1, 1, 1000, 1, 1, 7, 50, 111, "1|30", "1|30", 30, 5, 50, 4, 5, },
	id_70008 = {70008, "强袭贝", "最终伤害型", "conch_zhongshang.png", nil, 13, 2, 1, 1, 1000, 1, 1, 8, 50, 101, "29|6", "29|6", 30, 5, 50, 4, 6, },
	id_70009 = {70009, "霸体贝", "最终免伤型", "conch_zhongfang.png", nil, 13, 2, 1, 1, 1000, 1, 1, 9, 50, 101, "30|6", "30|6", 30, 5, 50, 4, 7, },
	id_70010 = {70010, "炎贝", "火伤型", "conch_zhuoshao.png", nil, 13, 2, 1, 1, 1000, 1, 1, 10, 50, 101, "86|9", "86|9", 30, 5, 50, 4, 8, },
	id_70011 = {70011, "毒贝", "毒伤型", "conch_du.png", nil, 13, 2, 1, 1, 1000, 1, 1, 11, 50, 101, "87|9", "87|9", 30, 5, 50, 4, 10, },
	id_70012 = {70012, "防火贝", "火抗型", "conch_zhuoshao_fang.png", nil, 13, 2, 1, 1, 1000, 1, 1, 12, 50, 121, "88|9", "88|9", 30, 5, 50, 4, 9, },
	id_70013 = {70013, "抗毒贝", "毒抗型", "conch_du_fang.png", nil, 13, 2, 1, 1, 1000, 1, 1, 13, 50, 121, "89|9", "89|9", 30, 5, 50, 4, 11, },
	id_70101 = {70101, "斩击贝", "物攻型", "conch_wugong.png", nil, 13, 3, 1, 1, 1000, 1, 1, 1, 200, 112, "2|12", "2|12", 30, 5, 50, 8, 1, },
	id_70102 = {70102, "激光贝", "魔攻型", "conch_mogong.png", nil, 13, 3, 1, 1, 1000, 1, 1, 2, 200, 112, "3|12", "3|12", 30, 5, 50, 8, 2, },
	id_70103 = {70103, "治疗贝", "治疗型", "conch_zhiliao.png", nil, 13, 3, 1, 1, 1000, 1, 1, 3, 200, 102, "84|12", "84|12", 30, 5, 50, 8, 12, },
	id_70104 = {70104, "营养贝", "被治疗型", "conch_beizhiliao.png", nil, 13, 3, 1, 1, 1000, 1, 1, 4, 200, 102, "85|18", "85|18", 30, 5, 50, 8, 13, },
	id_70105 = {70105, "铁甲贝", "物防型", "conch_wufang.png", nil, 13, 3, 1, 1, 1000, 1, 1, 5, 200, 112, "4|6", "4|6", 30, 5, 50, 8, 3, },
	id_70106 = {70106, "光墙贝", "魔防型", "conch_mofang.png", nil, 13, 3, 1, 1, 1000, 1, 1, 6, 200, 112, "5|6", "5|6", 30, 5, 50, 8, 4, },
	id_70107 = {70107, "生命贝", "生命型", "conch_shengming.png", nil, 13, 3, 1, 1, 1000, 1, 1, 7, 200, 112, "1|60", "1|60", 30, 5, 50, 8, 5, },
	id_70108 = {70108, "强袭贝", "最终伤害型", "conch_zhongshang.png", nil, 13, 3, 1, 1, 1000, 1, 1, 8, 200, 102, "29|12", "29|12", 30, 5, 50, 8, 6, },
	id_70109 = {70109, "霸体贝", "最终免伤型", "conch_zhongfang.png", nil, 13, 3, 1, 1, 1000, 1, 1, 9, 200, 102, "30|12", "30|12", 30, 5, 50, 8, 7, },
	id_70110 = {70110, "炎贝", "火伤型", "conch_zhuoshao.png", nil, 13, 3, 1, 1, 1000, 1, 1, 10, 200, 102, "86|18", "86|18", 30, 5, 50, 8, 8, },
	id_70111 = {70111, "毒贝", "毒伤型", "conch_du.png", nil, 13, 3, 1, 1, 1000, 1, 1, 11, 200, 102, "87|18", "87|18", 30, 5, 50, 8, 10, },
	id_70112 = {70112, "防火贝", "火抗型", "conch_zhuoshao_fang.png", nil, 13, 3, 1, 1, 1000, 1, 1, 12, 200, 122, "88|18", "88|18", 30, 5, 50, 8, 9, },
	id_70113 = {70113, "抗毒贝", "毒抗型", "conch_du_fang.png", nil, 13, 3, 1, 1, 1000, 1, 1, 13, 200, 122, "89|18", "89|18", 30, 5, 50, 8, 11, },
	id_70201 = {70201, "斩击贝", "物攻型", "conch_wugong.png", nil, 13, 4, 1, 1, 1000, 1, 1, 1, 500, 113, "2|24", "2|24", 30, 5, 50, 12, 1, },
	id_70202 = {70202, "激光贝", "魔攻型", "conch_mogong.png", nil, 13, 4, 1, 1, 1000, 1, 1, 2, 500, 113, "3|24", "3|24", 30, 5, 50, 12, 2, },
	id_70203 = {70203, "治疗贝", "治疗型", "conch_zhiliao.png", nil, 13, 4, 1, 1, 1000, 1, 1, 3, 500, 103, "84|24", "84|24", 30, 5, 50, 12, 12, },
	id_70204 = {70204, "营养贝", "被治疗型", "conch_beizhiliao.png", nil, 13, 4, 1, 1, 1000, 1, 1, 4, 500, 103, "85|36", "85|36", 30, 5, 50, 12, 13, },
	id_70205 = {70205, "铁甲贝", "物防型", "conch_wufang.png", nil, 13, 4, 1, 1, 1000, 1, 1, 5, 500, 113, "4|12", "4|12", 30, 5, 50, 12, 3, },
	id_70206 = {70206, "光墙贝", "魔防型", "conch_mofang.png", nil, 13, 4, 1, 1, 1000, 1, 1, 6, 500, 113, "5|12", "5|12", 30, 5, 50, 12, 4, },
	id_70207 = {70207, "生命贝", "生命型", "conch_shengming.png", nil, 13, 4, 1, 1, 1000, 1, 1, 7, 500, 113, "1|120", "1|120", 30, 5, 50, 12, 5, },
	id_70208 = {70208, "强袭贝", "最终伤害型", "conch_zhongshang.png", nil, 13, 4, 1, 1, 1000, 1, 1, 8, 500, 103, "29|24", "29|24", 30, 5, 50, 12, 6, },
	id_70209 = {70209, "霸体贝", "最终免伤型", "conch_zhongfang.png", nil, 13, 4, 1, 1, 1000, 1, 1, 9, 500, 103, "30|24", "30|24", 30, 5, 50, 12, 7, },
	id_70210 = {70210, "炎贝", "火伤型", "conch_zhuoshao.png", nil, 13, 4, 1, 1, 1000, 1, 1, 10, 500, 103, "86|36", "86|36", 30, 5, 50, 12, 8, },
	id_70211 = {70211, "毒贝", "毒伤型", "conch_du.png", nil, 13, 4, 1, 1, 1000, 1, 1, 11, 500, 103, "87|36", "87|36", 30, 5, 50, 12, 10, },
	id_70212 = {70212, "防火贝", "火抗型", "conch_zhuoshao_fang.png", nil, 13, 4, 1, 1, 1000, 1, 1, 12, 500, 123, "88|36", "88|36", 30, 5, 50, 12, 9, },
	id_70213 = {70213, "抗毒贝", "毒抗型", "conch_du_fang.png", nil, 13, 4, 1, 1, 1000, 1, 1, 13, 500, 123, "89|36", "89|36", 30, 5, 50, 12, 11, },
	id_70301 = {70301, "斩击贝", "物攻型", "conch_wugong.png", nil, 13, 5, 1, 1, 1000, 1, 1, 1, 1000, 114, "2|36", "2|36", 30, 5, 50, 16, 1, },
	id_70302 = {70302, "激光贝", "魔攻型", "conch_mogong.png", nil, 13, 5, 1, 1, 1000, 1, 1, 2, 1000, 114, "3|36", "3|36", 30, 5, 50, 16, 2, },
	id_70303 = {70303, "治疗贝", "治疗型", "conch_zhiliao.png", nil, 13, 5, 1, 1, 1000, 1, 1, 3, 1000, 104, "84|36", "84|36", 30, 5, 50, 16, 12, },
	id_70304 = {70304, "营养贝", "被治疗型", "conch_beizhiliao.png", nil, 13, 5, 1, 1, 1000, 1, 1, 4, 1000, 104, "85|54", "85|54", 30, 5, 50, 16, 13, },
	id_70305 = {70305, "铁甲贝", "物防型", "conch_wufang.png", nil, 13, 5, 1, 1, 1000, 1, 1, 5, 1000, 114, "4|18", "4|18", 30, 5, 50, 16, 3, },
	id_70306 = {70306, "光墙贝", "魔防型", "conch_mofang.png", nil, 13, 5, 1, 1, 1000, 1, 1, 6, 1000, 114, "5|18", "5|18", 30, 5, 50, 16, 4, },
	id_70307 = {70307, "生命贝", "生命型", "conch_shengming.png", nil, 13, 5, 1, 1, 1000, 1, 1, 7, 1000, 114, "1|180", "1|180", 30, 5, 50, 16, 5, },
	id_70308 = {70308, "强袭贝", "最终伤害型", "conch_zhongshang.png", nil, 13, 5, 1, 1, 1000, 1, 1, 8, 1000, 104, "29|36", "29|36", 30, 5, 50, 16, 6, },
	id_70309 = {70309, "霸体贝", "最终免伤型", "conch_zhongfang.png", nil, 13, 5, 1, 1, 1000, 1, 1, 9, 1000, 104, "30|36", "30|36", 30, 5, 50, 16, 7, },
	id_70310 = {70310, "炎贝", "火伤型", "conch_zhuoshao.png", nil, 13, 5, 1, 1, 1000, 1, 1, 10, 1000, 104, "86|54", "86|54", 30, 5, 50, 16, 8, },
	id_70311 = {70311, "毒贝", "毒伤型", "conch_du.png", nil, 13, 5, 1, 1, 1000, 1, 1, 11, 1000, 104, "87|54", "87|54", 30, 5, 50, 16, 10, },
	id_70312 = {70312, "防火贝", "火抗型", "conch_zhuoshao_fang.png", nil, 13, 5, 1, 1, 1000, 1, 1, 12, 1000, 124, "88|54", "88|54", 30, 5, 50, 16, 9, },
	id_70313 = {70313, "抗毒贝", "毒抗型", "conch_du_fang.png", nil, 13, 5, 1, 1, 1000, 1, 1, 13, 1000, 124, "89|54", "89|54", 30, 5, 50, 16, 11, },
	id_72001 = {72001, "小经验贝", "经验型", "conch_jingyan.png", nil, 13, 2, 0, 1, 1000, 1, 1, 14, 250, 107, nil, nil, 30, 5, 50, 2, 14, },
	id_72002 = {72002, "中经验贝", "经验型", "conch_jingyan.png", nil, 13, 2, 0, 1, 1000, 1, 1, 14, 500, 107, nil, nil, 30, 5, 50, 3, 14, },
	id_72003 = {72003, "大经验贝", "经验型", "conch_jingyan.png", nil, 13, 2, 0, 1, 1000, 1, 1, 14, 1000, 107, nil, nil, 30, 5, 50, 4, 14, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Item_conch["id_" .. key_id]
	assert(id_data, "Item_conch not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Item_conch) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Item_conch"] = nil
	package.loaded["DB_Item_conch"] = nil
	package.loaded["db/DB_Item_conch"] = nil
end

