-- Filename: DB_Item_disillusion.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Item_disillusion", package.seeall)

keys = {
	"id", "name", "info", "icon_small", "icon_big", "item_type", "quality", "sellable", "sellType", "sellNum", "maxStacking", "fix_type", "canDestroy", "base_attr", "affix_type", "is_decompos", "resolve_num", "need_items", "need_belly", "item_getway", "dropStrongHold", 
}

Item_disillusion = {
	id_811001 = {811001, "扳手", "能工巧匠的工具，觉醒伙伴的必备材料。", "small_lv_jixie_1.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|30,3|30,1|173", 1, 1, 5, nil, nil, "20", "900001,901001,902001,903001,904001", },
	id_811002 = {811002, "钢锯", "臂力过人的船工的首选工具，觉醒伙伴的必备材料。", "small_lv_jixie_2.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "4|29,5|29,1|194", 2, 1, 5, nil, nil, "20", "900001,901001,902001,903001,904001", },
	id_811003 = {811003, "螺丝刀", "船工的常用工具，觉醒伙伴的必备材料。", "small_lv_jixie_3.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|56,3|56,1|65", 3, 1, 5, nil, nil, "20", "900001,901001,902001,903001,904001", },
	id_812001 = {812001, "扳手", "能工巧匠的工具，觉醒伙伴的必备材料。", "small_lan_jixie_1.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|60,3|60,1|346", 1, 1, 25, "811001|2,811002|1,811003|2", 10000, "20", "905001,908001,911001,914001,917001,920001", },
	id_812002 = {812002, "钢锯", "臂力过人的船工的首选工具，觉醒伙伴的必备材料。", "small_lan_jixie_2.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "4|58,5|58,1|389", 2, 1, 25, "811001|2,811002|2,811003|2", 10000, "20", "906001,909001,912001,915001,918001,921001", },
	id_812003 = {812003, "螺丝刀", "船工的常用工具，觉醒伙伴的必备材料。", "small_lan_jixie_3.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|112,3|112,1|130", 3, 1, 25, "811001|1,811002|2,811003|2", 10000, "20", "907001,910001,913001,916001,919001", },
	id_813001 = {813001, "扳手", "能工巧匠的工具，觉醒伙伴的必备材料。", "small_zi_jixie_1.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|122,3|122,1|694", 1, 1, 200, "812001|3,812002|3,812003|2", 80000, "20", nil, },
	id_813002 = {813002, "钢锯", "臂力过人的船工的首选工具，觉醒伙伴的必备材料。", "small_zi_jixie_2.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "4|116,5|116,1|781", 2, 1, 200, "812001|2,812002|3,812003|3", 80000, "20", nil, },
	id_813003 = {813003, "螺丝刀", "船工的常用工具，觉醒伙伴的必备材料。", "small_zi_jixie_3.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|226,3|226,1|260", 3, 1, 200, "812001|3,812002|2,812003|3", 80000, "20", nil, },
	id_814001 = {814001, "扳手", "能工巧匠的工具，觉醒伙伴的必备材料。", "small_zi_jixie_1.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|180,3|180,1|1029", 1, 1, 1000, "812001|4,812003|4,813001|4", 200000, "20", nil, },
	id_814002 = {814002, "钢锯", "臂力过人的船工的首选工具，觉醒伙伴的必备材料。", "small_zi_jixie_2.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "4|171,5|171,1|1157", 2, 1, 1000, "812002|4,812003|4,813002|4", 200000, "20", nil, },
	id_814003 = {814003, "螺丝刀", "船工的常用工具，觉醒伙伴的必备材料。", "small_zi_jixie_3.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|334,3|334,1|386", 3, 1, 1000, "812001|4,812002|4,813003|4", 200000, "20", nil, },
	id_815001 = {815001, "扳手", "能工巧匠的工具，觉醒伙伴的必备材料。", "small_zi_jixie_1.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|204,3|204,1|1166", 1, 1, 3000, nil, nil, "20", nil, },
	id_815002 = {815002, "钢锯", "臂力过人的船工的首选工具，觉醒伙伴的必备材料。", "small_zi_jixie_2.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "4|194,5|194,1|1312", 2, 1, 3000, nil, nil, "20", nil, },
	id_815003 = {815003, "螺丝刀", "船工的常用工具，觉醒伙伴的必备材料。", "small_zi_jixie_3.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|379,3|379,1|437", 3, 1, 3000, nil, nil, "20", nil, },
	id_821001 = {821001, "报纸", "信息量满满的报纸，觉醒伙伴的必备材料。", "small_lv_shuji_1.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|30,3|30,1|173", 1, 1, 5, nil, nil, "20", "900002,901002,902002,903002,904002", },
	id_821002 = {821002, "航海日志", "记载了航行中的经历，觉醒伙伴的必备材料。", "small_lv_shuji_2.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "4|29,5|29,1|194", 2, 1, 5, nil, nil, "20", "900002,901002,902002,903002,904002", },
	id_821003 = {821003, "百科全书", "满满的都是知识，觉醒伙伴的必备材料。", "small_lv_shuji_3.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|56,3|56,1|65", 3, 1, 5, nil, nil, "20", "900002,901002,902002,903002,904002", },
	id_822001 = {822001, "报纸", "信息量满满的报纸，觉醒伙伴的必备材料。", "small_lan_shuji_1.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|60,3|60,1|346", 1, 1, 25, "821001|2,821002|1,821003|2", 10000, "20", "905002,908002,911002,914002,917002,920002", },
	id_822002 = {822002, "航海日志", "记载了航行中的经历，觉醒伙伴的必备材料。", "small_lan_shuji_2.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "4|58,5|58,1|389", 2, 1, 25, "821001|2,821002|2,821003|2", 10000, "20", "906002,909002,912002,915002,918002,921002", },
	id_822003 = {822003, "百科全书", "满满的都是知识，觉醒伙伴的必备材料。", "small_lan_shuji_3.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|112,3|112,1|130", 3, 1, 25, "821001|1,821002|2,821003|2", 10000, "20", "907002,910002,913002,916002,919002", },
	id_823001 = {823001, "报纸", "信息量满满的报纸，觉醒伙伴的必备材料。", "small_zi_shuji_1.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|122,3|122,1|694", 1, 1, 200, "822001|3,822002|3,822003|2", 80000, "20", nil, },
	id_823002 = {823002, "航海日志", "记载了航行中的经历，觉醒伙伴的必备材料。", "small_zi_shuji_2.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "4|116,5|116,1|781", 2, 1, 200, "822001|2,822002|3,822003|3", 80000, "20", nil, },
	id_823003 = {823003, "百科全书", "满满的都是知识，觉醒伙伴的必备材料。", "small_zi_shuji_3.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|226,3|226,1|260", 3, 1, 200, "822001|3,822002|2,822003|3", 80000, "20", nil, },
	id_824001 = {824001, "报纸", "信息量满满的报纸，觉醒伙伴的必备材料。", "small_zi_shuji_1.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|180,3|180,1|1029", 1, 1, 1000, "822001|4,822003|4,823001|4", 200000, "20", nil, },
	id_824002 = {824002, "航海日志", "记载了航行中的经历，觉醒伙伴的必备材料。", "small_zi_shuji_2.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "4|171,5|171,1|1157", 2, 1, 1000, "822002|4,822003|4,823002|4", 200000, "20", nil, },
	id_824003 = {824003, "百科全书", "满满的都是知识，觉醒伙伴的必备材料。", "small_zi_shuji_3.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|334,3|334,1|386", 3, 1, 1000, "822001|4,822002|4,823003|4", 200000, "20", nil, },
	id_825001 = {825001, "报纸", "信息量满满的报纸，觉醒伙伴的必备材料。", "small_zi_shuji_1.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|204,3|204,1|1166", 1, 1, 3000, nil, nil, "20", nil, },
	id_825002 = {825002, "航海日志", "记载了航行中的经历，觉醒伙伴的必备材料。", "small_zi_shuji_2.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "4|194,5|194,1|1312", 2, 1, 3000, nil, nil, "20", nil, },
	id_825003 = {825003, "百科全书", "满满的都是知识，觉醒伙伴的必备材料。", "small_zi_shuji_3.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|379,3|379,1|437", 3, 1, 3000, nil, nil, "20", nil, },
	id_831001 = {831001, "餐刀", "锋利的餐刀，觉醒伙伴的必备材料。", "small_lv_canju_1.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|30,3|30,1|173", 1, 1, 5, nil, nil, "20", "900003,901003,902003,903003,904003", },
	id_831002 = {831002, "餐叉", "方便使用的餐叉，觉醒伙伴的必备材料。", "small_lv_canju_2.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "4|29,5|29,1|194", 2, 1, 5, nil, nil, "20", "900003,901003,902003,903003,904003", },
	id_831003 = {831003, "勺子", "好用的勺子，觉醒伙伴的必备材料。", "small_lv_canju_3.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|56,3|56,1|65", 3, 1, 5, nil, nil, "20", "900003,901003,902003,903003,904003", },
	id_832001 = {832001, "餐刀", "锋利的餐刀，觉醒伙伴的必备材料。", "small_lan_canju_1.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|60,3|60,1|346", 1, 1, 25, "831001|2,831002|1,831003|2", 10000, "20", "905003,908003,911003,914003,917003,920003", },
	id_832002 = {832002, "餐叉", "方便使用的餐叉，觉醒伙伴的必备材料。", "small_lan_canju_2.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "4|58,5|58,1|389", 2, 1, 25, "831001|2,831002|2,831003|2", 10000, "20", "906003,909003,912003,915003,918003,921003", },
	id_832003 = {832003, "勺子", "好用的勺子，觉醒伙伴的必备材料。", "small_lan_canju_3.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|112,3|112,1|130", 3, 1, 25, "831001|1,831002|2,831003|2", 10000, "20", "907003,910003,913003,916003,919003", },
	id_833001 = {833001, "餐刀", "锋利的餐刀，觉醒伙伴的必备材料。", "small_zi_canju_1.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|122,3|122,1|694", 1, 1, 200, "832001|3,832002|3,832003|2", 80000, "20", nil, },
	id_833002 = {833002, "餐叉", "方便使用的餐叉，觉醒伙伴的必备材料。", "small_zi_canju_2.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "4|116,5|116,1|781", 2, 1, 200, "832001|2,832002|3,832003|3", 80000, "20", nil, },
	id_833003 = {833003, "勺子", "好用的勺子，觉醒伙伴的必备材料。", "small_zi_canju_3.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|226,3|226,1|260", 3, 1, 200, "832001|3,832002|2,832003|3", 80000, "20", nil, },
	id_834001 = {834001, "餐刀", "锋利的餐刀，觉醒伙伴的必备材料。", "small_zi_canju_1.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|180,3|180,1|1029", 1, 1, 1000, "832001|4,832003|4,833001|4", 200000, "20", nil, },
	id_834002 = {834002, "餐叉", "方便使用的餐叉，觉醒伙伴的必备材料。", "small_zi_canju_2.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "4|171,5|171,1|1157", 2, 1, 1000, "832002|4,832003|4,833002|4", 200000, "20", nil, },
	id_834003 = {834003, "勺子", "好用的勺子，觉醒伙伴的必备材料。", "small_zi_canju_3.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|334,3|334,1|386", 3, 1, 1000, "832001|4,832002|4,833003|4", 200000, "20", nil, },
	id_835001 = {835001, "餐刀", "锋利的餐刀，觉醒伙伴的必备材料。", "small_zi_canju_1.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|204,3|204,1|1166", 1, 1, 3000, nil, nil, "20", nil, },
	id_835002 = {835002, "餐叉", "方便使用的餐叉，觉醒伙伴的必备材料。", "small_zi_canju_2.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "4|194,5|194,1|1312", 2, 1, 3000, nil, nil, "20", nil, },
	id_835003 = {835003, "勺子", "好用的勺子，觉醒伙伴的必备材料。", "small_zi_canju_3.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|379,3|379,1|437", 3, 1, 3000, nil, nil, "20", nil, },
	id_841001 = {841001, "吉他", "音色饱满的吉他，觉醒伙伴的必备材料。", "small_lv_yueqi_1.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|30,3|30,1|173", 1, 1, 5, nil, nil, "20", "900004,901004,902004,903004,904004", },
	id_841002 = {841002, "小号", "吹响后声音洪亮的小号，觉醒伙伴的必备材料。", "small_lv_yueqi_2.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "4|29,5|29,1|194", 2, 1, 5, nil, nil, "20", "900004,901004,902004,903004,904004", },
	id_841003 = {841003, "竖琴", "能奏出动听曲调的竖琴，觉醒伙伴的必备材料。", "small_lv_yueqi_3.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|56,3|56,1|65", 3, 1, 5, nil, nil, "20", "900004,901004,902004,903004,904004", },
	id_842001 = {842001, "吉他", "音色饱满的吉他，觉醒伙伴的必备材料。", "small_lan_yueqi_1.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|60,3|60,1|346", 1, 1, 25, "841001|2,841002|1,841003|2", 10000, "20", "905004,908004,911004,914004,917004,920004", },
	id_842002 = {842002, "小号", "吹响后声音洪亮的小号，觉醒伙伴的必备材料。", "small_lan_yueqi_2.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "4|58,5|58,1|389", 2, 1, 25, "841001|2,841002|2,841003|2", 10000, "20", "906004,909004,912004,915004,918004,921004", },
	id_842003 = {842003, "竖琴", "能奏出动听曲调的竖琴，觉醒伙伴的必备材料。", "small_lan_yueqi_3.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|112,3|112,1|130", 3, 1, 25, "841001|1,841002|2,841003|2", 10000, "20", "907004,910004,913004,916004,919004", },
	id_843001 = {843001, "吉他", "音色饱满的吉他，觉醒伙伴的必备材料。", "small_zi_yueqi_1.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|122,3|122,1|694", 1, 1, 200, "842001|3,842002|3,842003|2", 80000, "20", nil, },
	id_843002 = {843002, "小号", "吹响后声音洪亮的小号，觉醒伙伴的必备材料。", "small_zi_yueqi_2.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "4|116,5|116,1|781", 2, 1, 200, "842001|2,842002|3,842003|3", 80000, "20", nil, },
	id_843003 = {843003, "竖琴", "能奏出动听曲调的竖琴，觉醒伙伴的必备材料。", "small_zi_yueqi_3.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|226,3|226,1|260", 3, 1, 200, "842001|3,842002|2,842003|3", 80000, "20", nil, },
	id_844001 = {844001, "吉他", "音色饱满的吉他，觉醒伙伴的必备材料。", "small_zi_yueqi_1.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|180,3|180,1|1029", 1, 1, 1000, "842001|4,842003|4,843001|4", 200000, "20", nil, },
	id_844002 = {844002, "小号", "吹响后声音洪亮的小号，觉醒伙伴的必备材料。", "small_zi_yueqi_2.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "4|171,5|171,1|1157", 2, 1, 1000, "842002|4,842003|4,843002|4", 200000, "20", nil, },
	id_844003 = {844003, "竖琴", "能奏出动听曲调的竖琴，觉醒伙伴的必备材料。", "small_zi_yueqi_3.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|334,3|334,1|386", 3, 1, 1000, "842001|4,842002|4,843003|4", 200000, "20", nil, },
	id_845001 = {845001, "吉他", "音色饱满的吉他，觉醒伙伴的必备材料。", "small_zi_yueqi_1.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|204,3|204,1|1166", 1, 1, 3000, nil, nil, "20", nil, },
	id_845002 = {845002, "小号", "吹响后声音洪亮的小号，觉醒伙伴的必备材料。", "small_zi_yueqi_2.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "4|194,5|194,1|1312", 2, 1, 3000, nil, nil, "20", nil, },
	id_845003 = {845003, "竖琴", "能奏出动听曲调的竖琴，觉醒伙伴的必备材料。", "small_zi_yueqi_3.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|379,3|379,1|437", 3, 1, 3000, nil, nil, "20", nil, },
	id_851001 = {851001, "e类道具绿1", "e类道具绿1", "lanboqiu.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|30,3|30,1|173", 1, 1, 5, nil, nil, nil, nil, },
	id_851002 = {851002, "e类道具绿2", "e类道具绿2", "lanboqiu.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "4|29,5|29,1|194", 2, 1, 5, nil, nil, nil, nil, },
	id_851003 = {851003, "e类道具绿3", "e类道具绿3", "lanboqiu.png", nil, 16, 3, 0, 1, 50, 9999, nil, nil, "2|56,3|56,1|65", 3, 1, 5, nil, nil, nil, nil, },
	id_852001 = {852001, "e类道具蓝1", "e类道具蓝1", "lanboqiu.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|60,3|60,1|346", 1, 1, 25, "851001|2,851002|1,851003|2", 10000, nil, nil, },
	id_852002 = {852002, "e类道具蓝2", "e类道具蓝2", "lanboqiu.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "4|58,5|58,1|389", 2, 1, 25, "851001|2,851002|2,851003|2", 10000, nil, nil, },
	id_852003 = {852003, "e类道具蓝3", "e类道具蓝3", "lanboqiu.png", nil, 16, 4, 0, 1, 50, 9999, nil, nil, "2|112,3|112,1|130", 3, 1, 25, "851001|1,851002|2,851003|2", 10000, nil, nil, },
	id_853001 = {853001, "e类道具紫1", "e类道具紫1", "lanboqiu.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|122,3|122,1|694", 1, 1, 200, "852001|3,852002|3,852003|2", 80000, nil, nil, },
	id_853002 = {853002, "e类道具紫2", "e类道具紫2", "lanboqiu.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "4|116,5|116,1|781", 2, 1, 200, "852001|2,852002|3,852003|3", 80000, nil, nil, },
	id_853003 = {853003, "e类道具紫3", "e类道具紫3", "lanboqiu.png", nil, 16, 5, 0, 1, 50, 9999, nil, nil, "2|226,3|226,1|260", 3, 1, 200, "852001|3,852002|2,852003|3", 80000, nil, nil, },
	id_854001 = {854001, "e类道具橙1", "e类道具橙1", "lanboqiu.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|180,3|180,1|1029", 1, 1, 1000, "852001|4,852003|4,853001|4", 200000, nil, nil, },
	id_854002 = {854002, "e类道具橙2", "e类道具橙2", "lanboqiu.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "4|171,5|171,1|1157", 2, 1, 1000, "852002|4,852003|4,853002|4", 200000, nil, nil, },
	id_854003 = {854003, "e类道具橙3", "e类道具橙3", "lanboqiu.png", nil, 16, 6, 0, 1, 50, 9999, nil, nil, "2|334,3|334,1|386", 3, 1, 1000, "852001|4,852002|4,853003|4", 200000, nil, nil, },
	id_855001 = {855001, "e类道具红1", "e类道具红1", "lanboqiu.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|204,3|204,1|1166", 1, 1, 3000, nil, nil, nil, nil, },
	id_855002 = {855002, "e类道具红2", "e类道具红2", "lanboqiu.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "4|194,5|194,1|1312", 2, 1, 3000, nil, nil, nil, nil, },
	id_855003 = {855003, "e类道具红3", "e类道具红3", "lanboqiu.png", nil, 16, 7, 0, 1, 50, 9999, nil, nil, "2|379,3|379,1|437", 3, 1, 3000, nil, nil, nil, nil, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Item_disillusion["id_" .. key_id]
	assert(id_data, "Item_disillusion not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Item_disillusion) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Item_disillusion"] = nil
	package.loaded["DB_Item_disillusion"] = nil
	package.loaded["db/DB_Item_disillusion"] = nil
end

