-- Filename: DB_Item_arm.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Item_arm", package.seeall)

keys = {
	"id", "name", "info", "icon_small", "icon_big", "item_type", "quality", "sellable", "sellType", "sellNum", "maxStacking", "canDestroy", "type", "lvLimit", "jobLimit", "baseLife", "basePhyAtt", "baseMagAtt", "basePhyDef", "baseMagDef", "lifePL", "phyAttPL", "magAttPL", "phyDefPL", "magDefPL", "hpRatioPL", "phyAttRatioPL", "phyDefRatioPL", "magAttRatioPL", "magDefRatioPL", "strengthenFeeID", "resolveId", "base_score", "grow_score", "level_limit_ratio", "baseGenAtt", "genAttPL", "genAttRatioPL", "resetCostGold", "canEnchant", "maxEnchantLV", "enchantLVlimit", "enchantAffix", "addEnchantAffix", "expId", "returnId", "fragmentId", 
}

Item_arm = {
	id_101212 = {101212, "碧绿双刀", "[碧绿]套装。结实的双刀。", "small_lv_wuqi_T_1.png", "big_lv_wuqi_T_1.png", 1, 3, 1, 1, 4500, 1, 1, 1, 1, 21, 0, 42, 42, 0, 0, 0, 600, 600, 0, 0, nil, nil, nil, nil, nil, 21, 18, 7, 0, 2, 0, 0, nil, 5, 1, 15, nil, "2|21,3|21,21|60", nil, 3003, "60504|60501", nil, },
	id_101222 = {101222, "浪人长刀", "[浪人]套装。浪人使用的长刀。", "small_lv_wuqi_T_2.png", "big_lv_wuqi_T_2.png", 1, 3, 1, 1, 4500, 1, 1, 1, 1, 22, 0, 42, 42, 0, 0, 0, 600, 600, 0, 0, nil, nil, nil, nil, nil, 21, 18, 8, 0, 2, 0, 0, nil, 5, 1, 15, nil, "2|21,3|21,21|60", nil, 3003, "60504|60501", nil, },
	id_101312 = {101312, "冒险手枪", "[冒险]套装。精巧的左轮枪，可以藏到衣服里，出其不意地给敌人来一发。", "small_lan_wuqi_T_1.png", "big_lan_wuqi_T_1.png", 1, 4, 1, 1, 12000, 1, 1, 1, 1, 31, 0, 99, 99, 0, 0, 0, 900, 900, 0, 0, nil, nil, nil, nil, nil, 31, 900, 12, 0, 2, 0, 0, nil, 10, 1, 40, nil, "2|32,3|32,21|60", nil, 3004, "60504|60501", 1013124, },
	id_101322 = {101322, "骑士长刀", "[骑士]套装。出自名家之手的长刀。", "small_lan_wuqi_T_2.png", "big_lan_wuqi_T_2.png", 1, 4, 1, 1, 12000, 1, 1, 1, 1, 32, 0, 117, 117, 0, 0, 0, 1100, 1100, 0, 0, nil, nil, nil, nil, nil, 41, 2160, 13, 0, 2, 0, 0, nil, 10, 1, 40, nil, "2|39,3|39,21|60", nil, 3004, "60504|60501", 1013224, },
	id_101412 = {101412, "武装长刀", "[武装]套装。长刀上散发着黑色火焰。", "small_zi_wuqi_T_1.png", "big_zi_wuqi_T_1.png", 1, 5, 1, 1, 24000, 1, 1, 1, 1, 41, 0, 216, 216, 0, 0, 0, 1400, 1400, 0, 0, nil, nil, nil, nil, nil, 51, 8640, 17, 0, 2, 0, 0, nil, 50, 1, 40, nil, "2|49,3|49,21|60", "15|2|280,15|3|280,20|2|420,20|3|420,25|2|560,25|3|560,30|12|350,30|13|350,35|12|400,35|13|400,40|12|500,40|13|500", 3005, "60504|60501", 1014125, },
	id_101422 = {101422, "精钢长刀", "[精钢]套装。异常华丽的长刀。", "small_zi_wuqi_T_2.png", "big_zi_wuqi_T_2.png", 1, 5, 1, 1, 24000, 1, 1, 1, 1, 42, 0, 264, 264, 0, 0, 0, 1800, 1800, 0, 0, nil, nil, nil, nil, nil, 61, 21600, 18, 0, 2, 0, 0, nil, 50, 1, 40, nil, "2|63,3|63,21|60", "15|2|340,15|3|340,20|2|510,20|3|510,25|2|680,25|3|680,30|12|450,30|13|450,35|12|500,35|13|500,40|12|600,40|13|600", 3005, "60504|60501", 1014225, },
	id_101432 = {101432, "战斗火箭", "[战斗]套装。炮管很粗的火箭筒。", "small_zi_wuqi_T_3.png", "big_zi_wuqi_T_3.png", 1, 5, 1, 1, 24000, 1, 1, 1, 1, 43, 0, 216, 216, 0, 0, 0, 1400, 1400, 0, 0, nil, nil, nil, nil, nil, 61, 21600, 19, 0, 2, 0, 0, nil, 50, 1, 40, nil, "2|49,3|49,21|60", nil, 3005, "60504|60501", 1014325, },
	id_101512 = {101512, "霸王威慑刀", "[霸王]套装。尚未出鞘，就已让人不寒而栗。", "small_cheng_wuqi_T_1.png", "big_cheng_wuqi_T_1.png", 1, 6, 1, 1, 48000, 1, 1, 1, 1, 51, 0, 468, 468, 0, 0, 0, 2200, 2200, 0, 0, nil, nil, nil, nil, nil, 71, 90000, 22, 0, 2, 0, 0, nil, 100, 1, 40, nil, "2|77,3|77,21|60", "0|26|400,15|2|400,15|3|400,20|2|600,20|3|600,25|2|800,25|3|800,30|12|500,30|13|500,35|12|600,35|13|600,40|12|700,40|13|700", 3006, "60504|60501", 1015126, },
	id_101522 = {101522, "英雄裁决剑", "[英雄]套装。黄金打造的长剑。", "small_cheng_wuqi_T_2.png", "big_cheng_wuqi_T_2.png", 1, 6, 1, 1, 48000, 1, 1, 1, 1, 52, 0, 576, 576, 0, 0, 0, 2800, 2800, 0, 0, nil, nil, nil, nil, nil, 81, 189000, 23, 0, 2, 0, 0, nil, 100, 1, 40, nil, "2|98,3|98,21|60", "0|26|600,15|2|480,15|3|480,20|2|720,20|3|720,25|2|960,25|3|960,30|12|600,30|13|600,35|12|700,35|13|700,40|12|850,40|13|850", 3006, "60504|60501", 1015226, },
	id_101532 = {101532, "统御能量剑", "[统御]套装。剑身独有的略微弯曲的弧度，更有利于在使用时快速制服大量敌人。", "small_cheng_wuqi_T_3.png", "big_cheng_wuqi_T_3.png", 1, 6, 1, 1, 48000, 1, 1, 1, 1, 53, 0, 684, 684, 0, 0, 0, 3400, 3400, 0, 0, nil, nil, nil, nil, nil, 91, 405000, 24, 0, 2, 0, 0, nil, 100, 1, 40, nil, "2|119,3|119,21|60", "0|26|800,15|2|600,15|3|600,20|2|900,20|3|900,25|2|1200,25|3|1200,30|12|750,30|13|750,35|12|900,35|13|900,40|12|1050,40|13|1050", 3006, "60504|60501", 1015326, },
	id_102212 = {102212, "碧绿皮鞋", "[碧绿]套装。由绿色毛皮制作的皮鞋。", "small_lv_xiezi_T_1.png", "big_lv_xiezi_T_1.png", 1, 3, 1, 1, 5000, 1, 1, 2, 1, 21, 42, 0, 0, 14, 0, 600, 0, 0, 200, 0, nil, nil, nil, nil, nil, 22, 18, 7, 0, 2, 0, 0, nil, 5, 1, 15, nil, "4|7,1|21,28|50", nil, 3003, "60504|60501", nil, },
	id_102222 = {102222, "浪人木屐", "[浪人]套装。便宜耐用的木屐。", "small_lv_xiezi_T_2.png", "big_lv_xiezi_T_2.png", 1, 3, 1, 1, 5000, 1, 1, 2, 1, 22, 42, 0, 0, 14, 0, 600, 0, 0, 200, 0, nil, nil, nil, nil, nil, 22, 18, 8, 0, 2, 0, 0, nil, 5, 1, 15, nil, "4|7,1|21,28|50", nil, 3003, "60504|60501", nil, },
	id_102312 = {102312, "冒险皮靴", "[冒险]套装。厚实的皮靴。", "small_lan_xiezi_T_1.png", "big_lan_xiezi_T_1.png", 1, 4, 1, 1, 13000, 1, 1, 2, 1, 31, 99, 0, 0, 33, 0, 900, 0, 0, 300, 0, nil, nil, nil, nil, nil, 32, 900, 12, 0, 2, 0, 0, nil, 10, 1, 40, nil, "4|11,1|32,28|50", nil, 3004, "60504|60501", 1023124, },
	id_102322 = {102322, "骑士长靴", "[骑士]套装。精铁锻造的长靴，作战时穿着会有效抵挡伤害。", "small_lan_xiezi_T_2.png", "big_lan_xiezi_T_2.png", 1, 4, 1, 1, 13000, 1, 1, 2, 1, 32, 117, 0, 0, 36, 0, 1000, 0, 0, 400, 0, nil, nil, nil, nil, nil, 42, 2160, 13, 0, 2, 0, 0, nil, 10, 1, 40, nil, "4|14,1|35,28|50", nil, 3004, "60504|60501", 1023224, },
	id_102412 = {102412, "武装皮靴", "[武装]套装。具有耐磨耐折特性的长靴。", "small_zi_xiezi_T_1.png", "big_zi_xiezi_T_1.png", 1, 5, 1, 1, 26000, 1, 1, 2, 1, 41, 216, 0, 0, 70, 0, 1350, 0, 0, 550, 0, nil, nil, nil, nil, nil, 52, 8640, 17, 0, 2, 0, 0, nil, 50, 1, 40, nil, "4|19,1|47,28|50", "15|56|210,20|5|350,25|56|280,30|5|630,35|56|350,40|5|1050", 3005, "60504|60501", 1024125, },
	id_102422 = {102422, "精钢长靴", "[精钢]套装。结实钢材制造的长靴。", "small_zi_xiezi_T_2.png", "big_zi_xiezi_T_2.png", 1, 5, 1, 1, 26000, 1, 1, 2, 1, 42, 264, 0, 0, 76, 0, 1500, 0, 0, 700, 0, nil, nil, nil, nil, nil, 62, 21600, 18, 0, 2, 0, 0, nil, 50, 1, 40, nil, "4|25,1|53,28|50", "15|56|260,20|5|425,25|56|340,30|5|765,35|56|430,40|5|1280", 3005, "60504|60501", 1024225, },
	id_102432 = {102432, "战斗皮靴", "[战斗]套装。轻便耐磨的皮靴。", "small_zi_xiezi_T_3.png", "big_zi_xiezi_T_3.png", 1, 5, 1, 1, 26000, 1, 1, 2, 1, 43, 216, 0, 0, 68, 0, 1300, 0, 0, 500, 0, nil, nil, nil, nil, nil, 62, 21600, 19, 0, 2, 0, 0, nil, 50, 1, 40, nil, "4|18,1|46,28|50", nil, 3005, "60504|60501", 1024325, },
	id_102512 = {102512, "霸王威慑靴", "[霸王]套装。古朴结实的长靴。", "small_cheng_xiezi_T_1.png", "big_cheng_xiezi_T_1.png", 1, 6, 1, 1, 52500, 1, 1, 2, 1, 51, 468, 0, 0, 150, 0, 2100, 0, 0, 900, 0, nil, nil, nil, nil, nil, 72, 90000, 22, 0, 2, 0, 0, nil, 100, 1, 40, nil, "4|32,1|74,28|50", "0|76|400,15|56|300,20|5|500,25|56|400,30|5|900,35|56|500,40|5|1500", 3006, "60504|60501", 1025126, },
	id_102522 = {102522, "英雄裁决靴", "[英雄]套装。被陈列在藏宝室的鞋子。", "small_cheng_xiezi_T_2.png", "big_cheng_xiezi_T_2.png", 1, 6, 1, 1, 52500, 1, 1, 2, 1, 52, 576, 0, 0, 168, 0, 2400, 0, 0, 1200, 0, nil, nil, nil, nil, nil, 82, 189000, 23, 0, 2, 0, 0, nil, 100, 1, 40, nil, "4|42,1|84,28|50", "0|76|600,15|56|360,20|5|600,25|56|480,30|5|1080,35|56|600,40|5|1800", 3006, "60504|60501", 1025226, },
	id_102532 = {102532, "统御能量鞋", "[统御]套装。用特殊材料制成。", "small_cheng_xiezi_T_3.png", "big_cheng_xiezi_T_3.png", 1, 6, 1, 1, 52500, 1, 1, 2, 1, 53, 684, 0, 0, 186, 0, 2700, 0, 0, 1500, 0, nil, nil, nil, nil, nil, 92, 405000, 24, 0, 2, 0, 0, nil, 100, 1, 40, nil, "4|53,1|95,28|50", "0|76|800,15|56|450,20|5|750,25|56|600,30|5|1350,35|56|750,40|5|2250", 3006, "60504|60501", 1025326, },
	id_103212 = {103212, "碧绿礼帽", "[碧绿]套装。看起来高雅又活泼的礼帽。", "small_lv_toukui_T_1.png", "big_lv_toukui_T_1.png", 1, 3, 1, 1, 5000, 1, 1, 3, 1, 21, 42, 0, 0, 0, 14, 600, 0, 0, 0, 200, nil, nil, nil, nil, nil, 23, 18, 7, 0, 2, 0, 0, nil, 5, 1, 15, nil, "5|7,1|21,56|60", nil, 3003, "60504|60501", nil, },
	id_103222 = {103222, "浪人斗笠", "[浪人]套装。晴天遮阳，雨天基本遮不了多少雨的斗笠。", "small_lv_toukui_T_2.png", "big_lv_toukui_T_2.png", 1, 3, 1, 1, 5000, 1, 1, 3, 1, 22, 42, 0, 0, 0, 14, 600, 0, 0, 0, 200, nil, nil, nil, nil, nil, 23, 18, 8, 0, 2, 0, 0, nil, 5, 1, 15, nil, "5|7,1|21,56|60", nil, 3003, "60504|60501", nil, },
	id_103312 = {103312, "冒险船帽", "[冒险]套装。出海冒险前要准备的帽子，戴上之后信心倍增。", "small_lan_toukui_T_1.png", "big_lan_toukui_T_1.png", 1, 4, 1, 1, 13000, 1, 1, 3, 1, 31, 99, 0, 0, 0, 33, 900, 0, 0, 0, 300, nil, nil, nil, nil, nil, 33, 900, 12, 0, 2, 0, 0, nil, 10, 1, 40, nil, "5|11,1|32,56|60", nil, 3004, "60504|60501", 1033124, },
	id_103322 = {103322, "骑士头盔", "[骑士]套装。铁质的头盔，十分坚固。", "small_lan_toukui_T_2.png", "big_lan_toukui_T_2.png", 1, 4, 1, 1, 13000, 1, 1, 3, 1, 32, 117, 0, 0, 0, 36, 1000, 0, 0, 0, 400, nil, nil, nil, nil, nil, 43, 2160, 13, 0, 2, 0, 0, nil, 10, 1, 40, nil, "5|14,1|35,56|60", nil, 3004, "60504|60501", 1033224, },
	id_103412 = {103412, "武装钢盔", "[武装]套装。角斗士在战斗中用于防护的头盔。", "small_zi_toukui_T_1.png", "big_zi_toukui_T_1.png", 1, 5, 1, 1, 26000, 1, 1, 3, 1, 41, 216, 0, 0, 0, 70, 1350, 0, 0, 0, 550, nil, nil, nil, nil, nil, 53, 8640, 17, 0, 2, 0, 0, nil, 50, 1, 40, nil, "5|19,1|47,56|60", "15|57|210,20|4|350,25|57|280,30|4|630,35|57|350,40|4|1050", 3005, "60504|60501", 1034125, },
	id_103422 = {103422, "精钢风帽", "[精钢]套装。装饰有钢板的帽子。", "small_zi_toukui_T_2.png", "big_zi_toukui_T_2.png", 1, 5, 1, 1, 26000, 1, 1, 3, 1, 42, 264, 0, 0, 0, 76, 1500, 0, 0, 0, 700, nil, nil, nil, nil, nil, 63, 21600, 18, 0, 2, 0, 0, nil, 50, 1, 40, nil, "5|25,1|53,56|60", "15|57|260,20|4|425,25|57|340,30|4|765,35|57|430,40|4|1275", 3005, "60504|60501", 1034225, },
	id_103432 = {103432, "战斗钢盔", "[战斗]套装。带有护目镜的神奇头盔。", "small_zi_toukui_T_3.png", "big_zi_toukui_T_3.png", 1, 5, 1, 1, 26000, 1, 1, 3, 1, 43, 216, 0, 0, 0, 68, 1300, 0, 0, 0, 500, nil, nil, nil, nil, nil, 63, 21600, 19, 0, 2, 0, 0, nil, 50, 1, 40, nil, "5|18,1|46,56|60", nil, 3005, "60504|60501", 1034325, },
	id_103512 = {103512, "霸王威慑盔", "[霸王]套装。这如同恶魔般的弯角是强者的象征。", "small_cheng_toukui_T_1.png", "big_cheng_toukui_T_1.png", 1, 6, 1, 1, 52500, 1, 1, 3, 1, 51, 468, 0, 0, 0, 150, 2100, 0, 0, 0, 900, nil, nil, nil, nil, nil, 73, 90000, 22, 0, 2, 0, 0, nil, 100, 1, 40, nil, "5|32,1|74,56|60", "0|77|400,15|57|300,20|4|500,25|57|400,30|4|900,35|57|500,40|4|1500", 3006, "60504|60501", 1035126, },
	id_103522 = {103522, "英雄裁决盔", "[英雄]套装。具有极强防护能力的头盔。", "small_cheng_toukui_T_2.png", "big_cheng_toukui_T_2.png", 1, 6, 1, 1, 52500, 1, 1, 3, 1, 52, 576, 0, 0, 0, 168, 2400, 0, 0, 0, 1200, nil, nil, nil, nil, nil, 83, 189000, 23, 0, 2, 0, 0, nil, 100, 1, 40, nil, "5|42,1|84,56|60", "0|77|600,15|57|360,20|4|600,25|57|480,30|4|1080,35|57|600,40|4|1800", 3006, "60504|60501", 1035226, },
	id_103532 = {103532, "统御能量冠", "[统御]套装。上面镶嵌了许多珍贵的宝石。", "small_cheng_toukui_T_3.png", "big_cheng_toukui_T_3.png", 1, 6, 1, 1, 52500, 1, 1, 3, 1, 53, 684, 0, 0, 0, 186, 2700, 0, 0, 0, 1500, nil, nil, nil, nil, nil, 93, 405000, 24, 0, 2, 0, 0, nil, 100, 1, 40, nil, "5|53,1|95,56|60", "0|77|800,15|57|450,20|4|750,25|57|600,30|4|1350,35|57|750,40|4|2250", 3006, "60504|60501", 1035326, },
	id_104212 = {104212, "碧绿外套", "[碧绿]套装。淡绿布料，搭配金色肩章。", "small_lv_shangyi_T_1.png", "big_lv_shangyi_T_1.png", 1, 3, 1, 1, 3500, 1, 1, 4, 1, 21, 126, 0, 0, 0, 0, 1800, 0, 0, 0, 0, nil, nil, nil, nil, nil, 24, 18, 7, 0, 2, 0, 0, nil, 5, 1, 15, nil, "1|63,57|60", nil, 3003, "60504|60501", nil, },
	id_104222 = {104222, "浪人单褂", "[浪人]套装。浪人常穿的服装，布料厚实，结实耐脏。", "small_lv_shangyi_T_2.png", "big_lv_shangyi_T_2.png", 1, 3, 1, 1, 3500, 1, 1, 4, 1, 22, 126, 0, 0, 0, 0, 1800, 0, 0, 0, 0, nil, nil, nil, nil, nil, 24, 18, 8, 0, 2, 0, 0, nil, 5, 1, 15, nil, "1|63,57|60", nil, 3003, "60504|60501", nil, },
	id_104312 = {104312, "冒险马甲", "[冒险]套装。新型材料制成的马甲，具有防水功能。", "small_lan_shangyi_T_1.png", "big_lan_shangyi_T_1.png", 1, 4, 1, 1, 9000, 1, 1, 4, 1, 31, 297, 0, 0, 0, 0, 2700, 0, 0, 0, 0, nil, nil, nil, nil, nil, 34, 900, 12, 0, 2, 0, 0, nil, 10, 1, 40, nil, "1|95,57|60", nil, 3004, "60504|60501", 1043124, },
	id_104322 = {104322, "骑士外套", "[骑士]套装。骑士穿着的外套，有很高的防御力。", "small_lan_shangyi_T_2.png", "big_lan_shangyi_T_2.png", 1, 4, 1, 1, 9000, 1, 1, 4, 1, 32, 351, 0, 0, 0, 0, 3300, 0, 0, 0, 0, nil, nil, nil, nil, nil, 44, 2160, 13, 0, 2, 0, 0, nil, 10, 1, 40, nil, "1|116,57|60", nil, 3004, "60504|60501", 1043224, },
	id_104412 = {104412, "武装外套", "[武装]套装。穿着的时候可以对敌人起到极佳的威慑作用。", "small_zi_shangyi_T_1.png", "big_zi_shangyi_T_1.png", 1, 5, 1, 1, 18000, 1, 1, 4, 1, 41, 648, 0, 0, 0, 0, 4200, 0, 0, 0, 0, nil, nil, nil, nil, nil, 54, 8640, 17, 0, 2, 0, 0, nil, 50, 1, 40, nil, "1|147,57|60", "15|1|1400,20|1|2100,25|1|2800,30|11|350,35|11|400,40|11|500", 3005, "60504|60501", 1044125, },
	id_104422 = {104422, "精钢钢甲", "[精钢]套装。纯钢制作的上衣，相当结实。", "small_zi_shangyi_T_2.png", "big_zi_shangyi_T_2.png", 1, 5, 1, 1, 18000, 1, 1, 4, 1, 42, 792, 0, 0, 0, 0, 5400, 0, 0, 0, 0, nil, nil, nil, nil, nil, 64, 21600, 18, 0, 2, 0, 0, nil, 50, 1, 40, nil, "1|189,57|60", "15|1|1700,20|1|2550,25|1|3400,30|11|450,35|11|500,40|11|600", 3005, "60504|60501", 1044225, },
	id_104432 = {104432, "战斗夹克", "[战斗]套装。结实耐用的皮质上衣。", "small_zi_shangyi_T_3.png", "big_zi_shangyi_T_3.png", 1, 5, 1, 1, 18000, 1, 1, 4, 1, 43, 648, 0, 0, 0, 0, 4200, 0, 0, 0, 0, nil, nil, nil, nil, nil, 64, 21600, 19, 0, 2, 0, 0, nil, 50, 1, 40, nil, "1|147,57|60", nil, 3005, "60504|60501", 1044325, },
	id_104512 = {104512, "霸王威慑甲", "[霸王]套装。穿着这套铠甲的人都会受到众人的敬仰。", "small_cheng_shangyi_T_1.png", "big_cheng_shangyi_T_1.png", 1, 6, 1, 1, 36000, 1, 1, 4, 1, 51, 1404, 0, 0, 0, 0, 6600, 0, 0, 0, 0, nil, nil, nil, nil, nil, 74, 90000, 22, 0, 2, 0, 0, nil, 100, 1, 40, nil, "1|231,57|60", "0|27|400,15|1|2000,20|1|3000,25|1|4000,30|11|500,35|11|600,40|11|700", 3006, "60504|60501", 1045126, },
	id_104522 = {104522, "英雄裁决甲", "[英雄]套装。给予穿着者全方位的保护，材质特殊，轻便且坚硬。", "small_cheng_shangyi_T_2.png", "big_cheng_shangyi_T_2.png", 1, 6, 1, 1, 36000, 1, 1, 4, 1, 52, 1728, 0, 0, 0, 0, 8400, 0, 0, 0, 0, nil, nil, nil, nil, nil, 84, 189000, 23, 0, 2, 0, 0, nil, 100, 1, 40, nil, "1|294,57|60", "0|27|600,15|1|2400,20|1|3600,25|1|4800,30|11|600,35|11|700,40|11|850", 3006, "60504|60501", 1045226, },
	id_104532 = {104532, "统御能量衣", "[统御]套装。代表着尊贵身份的套装。", "small_cheng_shangyi_T_3.png", "big_cheng_shangyi_T_3.png", 1, 6, 1, 1, 36000, 1, 1, 4, 1, 53, 2052, 0, 0, 0, 0, 10200, 0, 0, 0, 0, nil, nil, nil, nil, nil, 94, 405000, 24, 0, 2, 0, 0, nil, 100, 1, 40, nil, "1|357,57|60", "0|27|800,15|1|3000,20|1|4500,25|1|6000,30|11|750,35|11|900,40|11|1050", 3006, "60504|60501", 1045326, },
	id_101391 = {101391, "勇者巨锤", "十分沉重的巨锤。", "small_zi_wuqi_J_10.png", "big_zi_wuqi_J_10.png", 1, 5, 1, 1, 20000, 1, 1, 1, 1, nil, 0, 168, 168, 0, 0, 0, 1200, 1200, 0, 0, nil, nil, nil, nil, nil, 51, 4000, 17, 0, 2, 0, 0, nil, 50, 1, 40, nil, "2|49,3|49,21|60", nil, 3005, "60504|60501", nil, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Item_arm["id_" .. key_id]
	assert(id_data, "Item_arm not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Item_arm) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Item_arm"] = nil
	package.loaded["DB_Item_arm"] = nil
	package.loaded["db/DB_Item_arm"] = nil
end

