-- Filename: DB_Level_up_guide.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Level_up_guide", package.seeall)

keys = {
	"level", "name1", "icon1", "desc1", "lv1", "jump1", "effect1", "name2", "icon2", "desc2", "lv2", "jump2", "effect2", "name3", "icon3", "desc3", "lv3", "jump3", "effect3", 
}

Level_up_guide = {
	id_2 = {2, "伙伴强化", "sj_partner_str.png", "强化伙伴可提升伙伴战斗力", 2, 0, 1, "酒馆", "sj_bar.png", "可招募强力伙伴", 3, 0, 0, "战斗2倍速", "sj_2x.png", "战斗中可开启2倍速度", 5, 0, 0, },
	id_3 = {3, "酒馆", "sj_bar.png", "可招募强力伙伴", 3, 0, 1, "等级礼包", "sj_level_reward.png", "等级提高更多好礼等你拿", 5, 0, 0, "战斗2倍速", "sj_2x.png", "战斗中可开启2倍速度", 5, 0, 0, },
	id_4 = {4, "伙伴进阶", "sj_partner.png", "进阶伙伴可大幅增加伙伴战斗力", 4, 0, 1, "等级礼包", "sj_level_reward.png", "等级提高更多好礼等你拿", 5, 0, 0, "战斗2倍速", "sj_2x.png", "战斗中可开启2倍速度", 5, 0, 0, },
	id_5 = {5, "等级礼包", "sj_level_reward.png", "等级提高更多好礼等你拿", 5, 0, 1, "战斗2倍速", "sj_2x.png", "战斗中可开启2倍速度", 5, 0, 1, "装备强化", "sj_equip.png", "强化装备可以大幅度提升战力", 7, 0, 0, },
	id_6 = {6, "每日任务", "sj_daytask.png", "完成每日任务可获得稀有物品", 6, 0, 1, "装备强化", "sj_equip.png", "强化装备可以大幅度提升战力", 7, 0, 0, "探索", "sj_explore.png", "探索可获得经验并获得稀有饰品", 9, 0, 0, },
	id_7 = {7, "装备强化", "sj_equip.png", "强化装备可以大幅度提升战力", 7, 0, 1, "探索", "sj_explore.png", "探索可获得经验并获得稀有饰品", 9, 0, 0, "全身强化", "sj_equip.png", "全身强化可一键强化全身装备", 10, 0, 0, },
	id_8 = {8, "装备强化", "sj_equip.png", "强化装备可以大幅度提升战力", 7, 2, 1, "探索", "sj_explore.png", "探索可获得经验并获得稀有饰品", 9, 0, 0, "全身强化", "sj_equip.png", "全身强化可一键强化全身装备", 10, 0, 0, },
	id_9 = {9, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 1, "全身强化", "sj_equip.png", "全身强化可一键强化全身装备", 10, 0, 0, "第四个伙伴栏位", "sj_four.png", "可上阵第四个伙伴", 13, 0, 0, },
	id_10 = {10, "全身强化", "sj_equip.png", "全身强化可一键强化全身装备", 10, 2, 1, "等级礼包", "sj_level_reward.png", "可领取10级等级礼包", 5, 0, 0, "第四个伙伴栏位", "sj_four.png", "可上阵第四个伙伴", 13, 0, 0, },
	id_11 = {11, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "第四个伙伴栏位", "sj_four.png", "可上阵第四个伙伴", 13, 0, 0, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, },
	id_12 = {12, "等级礼包", "sj_level_reward.png", "可领取12级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "第四个伙伴栏位", "sj_four.png", "可上阵第四个伙伴", 13, 0, 0, },
	id_13 = {13, "第四个伙伴栏位", "sj_four.png", "可上阵第四个伙伴", 13, 0, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "回收", "sj_decomposition.png", "回收伙伴影子可获得海魂", 16, 0, 0, },
	id_14 = {14, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 1, "回收", "sj_decomposition.png", "回收伙伴影子可获得海魂", 16, 0, 0, "第一个饰品栏位", "sj_treasure_4.png", "可装备第一个饰品", 18, 0, 0, },
	id_15 = {15, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "等级礼包", "sj_level_reward.png", "可领取15级等级礼包", 5, 0, 0, "回收", "sj_decomposition.png", "回收伙伴影子可获得海魂", 16, 0, 0, },
	id_16 = {16, "回收", "sj_decomposition.png", "回收伙伴影子可获得海魂", 16, 0, 1, "第一个饰品栏位", "sj_treasure_4.png", "可装备第一个饰品", 18, 0, 0, "公会", "sj_union.png", "可创建或加入公会", 19, 0, 0, },
	id_17 = {17, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 1, "第一个饰品栏位", "sj_treasure_4.png", "可装备第一个饰品", 18, 0, 0, "公会", "sj_union.png", "可创建或加入公会", 19, 0, 0, },
	id_18 = {18, "第一个饰品栏位", "sj_treasure_4.png", "可装备第一个饰品", 18, 2, 1, "等级礼包", "sj_level_reward.png", "可领取18级等级礼包", 5, 0, 0, "公会", "sj_union.png", "可创建或加入公会", 19, 0, 0, },
	id_19 = {19, "公会", "sj_union.png", "可创建或加入公会", 19, 0, 1, "第五个伙伴栏位", "sj_four.png", "可上阵第五个伙伴", 19, 0, 1, "深海监狱", "sj_prison.png", "可挑战深海监狱获得装备", 21, 0, 0, },
	id_20 = {20, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "深海监狱", "sj_prison.png", "可挑战深海监狱获得装备", 21, 0, 0, "第二个饰品栏位", "sj_treasure_4.png", "可装备第二个饰品", 22, 0, 0, },
	id_21 = {21, "深海监狱", "sj_prison.png", "可挑战深海监狱获得装备", 21, 0, 1, "伙伴突破", "sj_partner_str.png", "可将紫色伙伴突破为橙色伙伴", 22, 0, 0, "第二个饰品栏位", "sj_treasure_4.png", "可装备第二个饰品", 22, 0, 0, },
	id_22 = {22, "第二个饰品栏位", "sj_treasure_4.png", "可装备第二个饰品", 22, 2, 1, "伙伴突破", "sj_partner_str.png", "可将紫色伙伴突破为橙色伙伴", 22, 0, 1, "日常副本", "sj_acopy.png", "挑战日常副本可获得大量贝里和经验道具", 23, 0, 0, },
	id_23 = {23, "日常副本", "sj_acopy.png", "挑战日常副本可获得大量贝里和经验道具", 23, 0, 1, "等级礼包", "sj_level_reward.png", "可领取23级等级礼包", 5, 0, 0, "修炼", "sj_train.png", "修炼可大幅提升全体上阵伙伴属性", 24, 0, 0, },
	id_24 = {24, "修炼", "sj_train.png", "修炼可大幅提升全体上阵伙伴属性", 24, 0, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "第三个饰品栏位", "sj_treasure_4.png", "可装备第三个饰品", 25, 0, 0, },
	id_25 = {25, "第三个饰品栏位", "sj_treasure_4.png", "可装备第三个饰品", 25, 2, 1, "等级礼包", "sj_level_reward.png", "可领取25级等级礼包", 5, 0, 0, "第六个伙伴栏位", "sj_four.png", "可上阵第六个伙伴", 27, 0, 0, },
	id_26 = {26, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "第六个伙伴栏位", "sj_four.png", "可上阵第六个伙伴", 27, 0, 0, },
	id_27 = {27, "第六个伙伴栏位", "sj_four.png", "可上阵第六个伙伴", 27, 2, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "战斗3倍速", "sj_3x.png", "战斗中可开启3倍速度", 30, 0, 0, },
	id_28 = {28, "等级礼包", "sj_level_reward.png", "可领取28级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "战斗3倍速", "sj_3x.png", "战斗中可开启3倍速度", 30, 0, 0, },
	id_29 = {29, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "战斗3倍速", "sj_3x.png", "战斗中可开启3倍速度", 30, 0, 0, },
	id_30 = {30, "战斗3倍速", "sj_3x.png", "战斗中可开启3倍速度", 30, 0, 1, "等级礼包", "sj_level_reward.png", "可领取30级等级礼包", 5, 0, 0, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, },
	id_31 = {31, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "激战海王类", "sj_boss.png", "可每日挑战海王类获得木材", 32, 0, 0, },
	id_32 = {32, "激战海王类", "sj_boss.png", "可每日挑战海王类获得木材", 32, 0, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "装备附魔", "sj_enhance.png", "附魔可提高装备属性", 35, 0, 0, },
	id_33 = {33, "等级礼包", "sj_level_reward.png", "可领取33级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "装备附魔", "sj_enhance.png", "附魔可提高装备属性", 35, 0, 0, },
	id_34 = {34, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "装备附魔", "sj_enhance.png", "附魔可提高装备属性", 35, 0, 0, },
	id_35 = {35, "装备附魔", "sj_enhance.png", "附魔可提高装备属性", 35, 0, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "精英副本", "sj_elite.png", "攻打精英副本可获得大量奖励", 38, 0, 0, },
	id_36 = {36, "等级礼包", "sj_level_reward.png", "可领取36级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "精英副本", "sj_elite.png", "攻打精英副本可获得大量奖励", 38, 0, 0, },
	id_37 = {37, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "精英副本", "sj_elite.png", "攻打精英副本可获得大量奖励", 38, 0, 0, },
	id_38 = {38, "精英副本", "sj_elite.png", "攻打精英副本可获得大量奖励", 38, 0, 1, "等级礼包", "sj_level_reward.png", "可领取38级等级礼包", 5, 0, 0, "饰品精炼", "sj_treasure_refine.png", "精炼饰品可提升饰品属性", 40, 0, 0, },
	id_39 = {39, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "饰品精炼", "sj_treasure_refine.png", "精炼饰品可提升饰品属性", 40, 0, 0, },
	id_40 = {40, "饰品精炼", "sj_treasure_refine.png", "精炼饰品可提升饰品属性", 40, 0, 1, "等级礼包", "sj_level_reward.png", "可领取40级等级礼包", 5, 5, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_41 = {41, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_42 = {42, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, },
	id_43 = {43, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_44 = {44, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_45 = {45, "等级礼包", "sj_level_reward.png", "可领取45级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, },
	id_46 = {46, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_47 = {47, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "替补", "sj_bench.png", "可上阵替补伙伴", 50, 0, 0, },
	id_48 = {48, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "替补", "sj_bench.png", "可上阵替补伙伴", 50, 0, 0, },
	id_49 = {49, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "替补", "sj_bench.png", "可上阵替补伙伴", 50, 0, 0, },
	id_50 = {50, "替补", "sj_bench.png", "可上阵替补伙伴", 50, 2, 1, "等级礼包", "sj_level_reward.png", "可领取50级等级礼包", 5, 0, 0, "觉醒", "sj_awake.png", "觉醒伙伴可提升伙伴战斗力", 52, 0, 0, },
	id_51 = {51, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "觉醒", "sj_awake.png", "觉醒伙伴可提升伙伴战斗力", 52, 0, 0, },
	id_52 = {52, "觉醒", "sj_awake.png", "觉醒伙伴可提升伙伴战斗力", 52, 0, 1, "船炮", "sj_ship.png", "可在战斗中释放船炮技能", 55, 0, 0, "噩梦副本", "sj_acopy.png", "可挑战普通副本的噩梦难度", 55, 0, 0, },
	id_53 = {53, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "船炮", "sj_ship.png", "可在战斗中释放船炮技能", 55, 0, 0, "噩梦副本", "sj_acopy.png", "可挑战普通副本的噩梦难度", 55, 0, 0, },
	id_54 = {54, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "船炮", "sj_ship.png", "可在战斗中释放船炮技能", 55, 0, 0, "噩梦副本", "sj_acopy.png", "可挑战普通副本的噩梦难度", 55, 0, 0, },
	id_55 = {55, "噩梦副本", "sj_acopy.png", "可挑战普通副本的噩梦难度", 55, 0, 1, "船炮", "sj_ship.png", "可在战斗中释放船炮技能", 55, 0, 1, "等级礼包", "sj_level_reward.png", "可领取55级等级礼包", 5, 0, 0, },
	id_56 = {56, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_57 = {57, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_58 = {58, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_59 = {59, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_60 = {60, "等级礼包", "sj_level_reward.png", "可领取60级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, },
	id_61 = {61, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_62 = {62, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_63 = {63, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_64 = {64, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_65 = {65, "等级礼包", "sj_level_reward.png", "可领取65级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, },
	id_66 = {66, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_67 = {67, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_68 = {68, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_69 = {69, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_70 = {70, "等级礼包", "sj_level_reward.png", "可领取70级等级礼包", 5, 5, 1, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 0, 0, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, },
	id_71 = {71, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_72 = {72, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_73 = {73, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_74 = {74, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
	id_75 = {75, "探索", "sj_explore.png", "探索可提升主角经验并获得稀有饰品", 9, 11, 1, "竞技场", "sj_arena.png", "参加竞技可获得大量声望", 14, 0, 0, "资源岛", "sj_resource.png", "占领资源岛可以获得大量贝里", 42, 0, 0, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Level_up_guide["id_" .. key_id]
	assert(id_data, "Level_up_guide not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Level_up_guide) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Level_up_guide"] = nil
	package.loaded["DB_Level_up_guide"] = nil
	package.loaded["db/DB_Level_up_guide"] = nil
end

