-- Filename: DB_Vip_desc.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Vip_desc", package.seeall)

keys = {
	"id", "desc", "desc2", 
}

Vip_desc = {
	id_1 = {1, "※可购买VIP1礼包\n※可购买VIP1周礼包\n", "※每日可购买5次贝里\n※每日可购买2个体力药水(中)\n※每日可购买3个耐力药水(中)\n※每日可购买20个银钥匙\n※每日可购买20个金钥匙\n※每日可购买10个宝物礼盒\n※每日可购买10个极品精炼石\n※每日可购买5个钢材\n※每日可购买2个火药\n※每日伙伴商店可金币刷新25次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计2次\n※耐力上限变为15点\n※每日可金币购买2次竞技场挑战次数\n※每日宝物商店可金币刷新25次\n", },
	id_2 = {2, "※可购买VIP2礼包\n※可购买VIP2周礼包\n", "※每日可购买10次贝里\n※每日可购买3个体力药水(中)\n※每日可购买6个耐力药水(中)\n※每日可购买25个银钥匙\n※每日可购买25个金钥匙\n※每日可购买20个宝物礼盒\n※每日可购买20个极品精炼石\n※每日可购买10个钢材\n※每日可购买4个火药\n※每日伙伴商店可金币刷新30次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计3次\n※耐力上限变为18点\n※每日可金币购买1次日常副本\n※每日可金币购买3次竞技场挑战次数\n※每日宝物商店可金币刷新30次\n", },
	id_3 = {3, "※开启“神秘招募”功能\n※可购买VIP3礼包\n※可购买VIP3周礼包\n", "※每日可购买15次贝里\n※每日可购买4个体力药水(中)\n※每日可购买6个耐力药水(中)\n※每日可购买30个银钥匙\n※每日可购买30个金钥匙\n※每日可购买30个宝物礼盒\n※每日可购买30个极品精炼石\n※每日可购买20个钢材\n※每日可购买8个火药\n※每日伙伴商店可金币刷新40次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计3次\n※耐力上限变为20点\n※每日可金币购买1次日常副本\n※每日可金币购买4次竞技场挑战次数\n※每日宝物商店可金币刷新40次\n", },
	id_4 = {4, "※开启“一键探索”功能\n※可购买VIP4礼包\n※可购买VIP4周礼包\n", "※每日可购买20次贝里\n※每日可购买5个体力药水(中)\n※每日可购买10个耐力药水(中)\n※每日可购买35个银钥匙\n※每日可购买35个金钥匙\n※每日可购买40个宝物礼盒\n※每日可购买40个极品精炼石\n※每日可购买30个钢材\n※每日可购买12个火药\n※每日伙伴商店可金币刷新50次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计3次\n※耐力上限变为22点\n※每日可金币购买1次日常副本\n※每日可金币购买5次竞技场挑战次数\n※每日宝物商店可金币刷新50次\n", },
	id_5 = {5, "※可购买VIP5礼包\n※可购买VIP5周礼包\n", "※每日可购买25次贝里\n※每日可购买6个体力药水(中)\n※每日可购买10个耐力药水(中)\n※每日可购买40个银钥匙\n※每日可购买40个金钥匙\n※每日可购买50个宝物礼盒\n※每日可购买50个极品精炼石\n※每日可购买40个钢材\n※每日可购买16个火药\n※每日伙伴商店可金币刷新60次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计3次\n※耐力上限变为24点\n※每日可金币购买1次日常副本\n※每日可金币购买6次竞技场挑战次数\n※每日可购买噩梦副本挑战次数1次\n※每日宝物商店可金币刷新60次\n", },
	id_6 = {6, "※可购买VIP6礼包\n※可购买VIP6周礼包\n", "※每日可购买30次贝里\n※每日可购买8个体力药水(中)\n※每日可购买15个耐力药水(中)\n※每日可购买45个银钥匙\n※每日可购买45个金钥匙\n※每日可购买60个宝物礼盒\n※每日可购买60个极品精炼石\n※每日可购买50个钢材\n※每日可购买20个火药\n※每日伙伴商店可金币刷新70次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买1次日常副本\n※每日可购买公会副本攻打次数1次\n※每日可金币购买7次竞技场挑战次数\n※每日可购买噩梦副本挑战次数1次\n※每日宝物商店可金币刷新70次\n", },
	id_7 = {7, "※30级时开启活动副本跳过功能\n※可购买VIP7礼包\n※可购买VIP7周礼包\n", "※每日可购买35次贝里\n※每日可购买10个体力药水(中)\n※每日可购买15个耐力药水(中)\n※每日可购买50个银钥匙\n※每日可购买50个金钥匙\n※每日可购买70个宝物礼盒\n※每日可购买70个极品精炼石\n※每日可购买60个钢材\n※每日可购买24个火药\n※每日伙伴商店可金币刷新80次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买1次日常副本\n※每日可购买公会副本攻打次数1次\n※每日可金币购买8次竞技场挑战次数\n※每日可购买噩梦副本挑战次数1次\n※每日宝物商店可金币刷新80次\n", },
	id_8 = {8, "※可购买VIP8礼包\n※可购买VIP8周礼包\n", "※每日可购买50次贝里\n※每日可购买10个体力药水(中)\n※每日可购买15个耐力药水(中)\n※每日可购买55个银钥匙\n※每日可购买55个金钥匙\n※每日可购买80个宝物礼盒\n※每日可购买80个极品精炼石\n※每日可购买70个钢材\n※每日可购买28个火药\n※每日伙伴商店可金币刷新90次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买1次日常副本\n※每日可购买公会副本攻打次数1次\n※每日可金币购买9次竞技场挑战次数\n※每日可购买噩梦副本挑战次数1次\n※每日宝物商店可金币刷新90次\n", },
	id_9 = {9, "※可购买VIP9礼包\n※可购买VIP9周礼包\n", "※每日可购买60次贝里\n※每日可购买12个体力药水(中)\n※每日可购买20个耐力药水(中)\n※每日可购买60个银钥匙\n※每日可购买60个金钥匙\n※每日可购买90个宝物礼盒\n※每日可购买90个极品精炼石\n※每日可购买80个钢材\n※每日可购买32个火药\n※每日伙伴商店可金币刷新100次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买2次日常副本\n※每日可购买公会副本攻打次数1次\n※每日可金币购买10次竞技场挑战次数\n※每日可购买噩梦副本挑战次数2次\n※每日宝物商店可金币刷新100次\n", },
	id_10 = {10, "※可购买VIP10礼包\n※可购买VIP10周礼包\n", "※每日可购买80次贝里\n※每日可购买12个体力药水(中)\n※每日可购买20个耐力药水(中)\n※每日可购买65个银钥匙\n※每日可购买65个金钥匙\n※每日可购买100个宝物礼盒\n※每日可购买100个极品精炼石\n※每日可购买90个钢材\n※每日可购买36个火药\n※每日伙伴商店可金币刷新150次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买2次日常副本\n※每日可购买公会副本攻打次数1次\n※每日可金币购买11次竞技场挑战次数\n※每日可购买噩梦副本挑战次数2次\n※每日宝物商店可金币刷新150次\n", },
	id_11 = {11, "※可购买VIP11礼包\n※可购买VIP11周礼包\n", "※每日可购买100次贝里\n※每日可购买14个体力药水(中)\n※每日可购买25个耐力药水(中)\n※每日可购买70个银钥匙\n※每日可购买70个金钥匙\n※每日可购买110个宝物礼盒\n※每日可购买110个极品精炼石\n※每日可购买100个钢材\n※每日可购买40个火药\n※每日伙伴商店可金币刷新160次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买2次日常副本\n※每日可购买公会副本攻打次数1次\n※每日可金币购买12次竞技场挑战次数\n※每日可购买噩梦副本挑战次数2次\n※每日宝物商店可金币刷新160次\n", },
	id_12 = {12, "※可购买VIP12礼包\n※可购买VIP12周礼包\n", "※每日可购买110次贝里\n※每日可购买16个体力药水(中)\n※每日可购买30个耐力药水(中)\n※每日可购买75个银钥匙\n※每日可购买75个金钥匙\n※每日可购买120个宝物礼盒\n※每日可购买120个极品精炼石\n※每日可购买110个钢材\n※每日可购买44个火药\n※每日伙伴商店可金币刷新170次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买3次日常副本\n※每日可购买公会副本攻打次数2次\n※每日可金币购买13次竞技场挑战次数\n※每日可购买噩梦副本挑战次数2次\n※每日宝物商店可金币刷新170次\n", },
	id_13 = {13, "※可购买VIP13礼包\n※可购买VIP13周礼包\n", "※每日可购买120次贝里\n※每日可购买16个体力药水(中)\n※每日可购买30个耐力药水(中)\n※每日可购买80个银钥匙\n※每日可购买80个金钥匙\n※每日可购买130个宝物礼盒\n※每日可购买130个极品精炼石\n※每日可购买120个钢材\n※每日可购买48个火药\n※每日伙伴商店可金币刷新180次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买3次日常副本\n※每日可购买公会副本攻打次数2次\n※每日可金币购买14次竞技场挑战次数\n※每日可购买噩梦副本挑战次数2次\n※每日宝物商店可金币刷新180次\n", },
	id_14 = {14, "※可购买VIP14礼包\n※可购买VIP14周礼包\n", "※每日可购买130次贝里\n※每日可购买18个体力药水(中)\n※每日可购买35个耐力药水(中)\n※每日可购买85个银钥匙\n※每日可购买85个金钥匙\n※每日可购买140个宝物礼盒\n※每日可购买140个极品精炼石\n※每日可购买130个钢材\n※每日可购买52个火药\n※每日伙伴商店可金币刷新190次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买3次日常副本\n※每日可购买公会副本攻打次数2次\n※每日可金币购买15次竞技场挑战次数\n※每日可购买噩梦副本挑战次数3次\n※每日宝物商店可金币刷新190次\n", },
	id_15 = {15, "※可购买VIP15礼包\n※可购买VIP15周礼包\n", "※每日可购买140次贝里\n※每日可购买18个体力药水(中)\n※每日可购买35个耐力药水(中)\n※每日可购买90个银钥匙\n※每日可购买90个金钥匙\n※每日可购买150个宝物礼盒\n※每日可购买150个极品精炼石\n※每日可购买140个钢材\n※每日可购买56个火药\n※每日伙伴商店可金币刷新200次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买3次日常副本\n※每日可购买公会副本攻打次数2次\n※每日可金币购买16次竞技场挑战次数\n※每日可购买噩梦副本挑战次数3次\n※每日宝物商店可金币刷新200次\n", },
	id_16 = {16, "※可购买VIP16礼包\n※可购买VIP16周礼包\n", "※每日可购买150次贝里\n※每日可购买20个体力药水(中)\n※每日可购买40个耐力药水(中)\n※每日可购买100个银钥匙\n※每日可购买100个金钥匙\n※每日可购买160个宝物礼盒\n※每日可购买160个极品精炼石\n※每日可购买150个钢材\n※每日可购买60个火药\n※每日伙伴商店可金币刷新210次\n※每2小时增加一次伙伴商店免费刷新次数，最多可累计4次\n※耐力上限变为25点\n※每日可金币购买3次日常副本\n※每日可购买公会副本攻打次数2次\n※每日可金币购买17次竞技场挑战次数\n※每日可购买噩梦副本挑战次数4次\n※每日宝物商店可金币刷新210次\n", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Vip_desc["id_" .. key_id]
	assert(id_data, "Vip_desc not found " ..  key_id)
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Vip_desc) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Vip_desc"] = nil
	package.loaded["DB_Vip_desc"] = nil
	package.loaded["db/DB_Vip_desc"] = nil
end

